ARMmbed/DAPLink/source/common/cmsis-core/siliconlabs/efm32lg/efm32lgfull.h
  uint32_t         RESERVED15[72];    /**< Reserved for future use **/
  __IO uint32_t    DOEP0CTL;          /**< Device OUT Endpoint 0 Control Register  */
  uint32_t         RESERVED16[1];     /**< Reserved for future use **/
  __IO uint32_t    DOEP0INT;          /**< Device OUT Endpoint 0 Interrupt Register  */
  uint32_t         RESERVED17[1];     /**< Reserved for future use **/
  __IO uint32_t    DOEP0TSIZ;         /**< Device OUT Endpoint 0 Transfer Size Register  */
  __IO uint32_t    DOEP0DMAADDR;      /**< Device OUT Endpoint 0 DMA Address Register  */

  uint32_t         RESERVED18[2];     /**< Reserved registers */
  USB_DOEP_TypeDef DOEP[6];           /**< Device OUT Endpoint x+1 Registers */

  uint32_t         RESERVED19[136];   /**< Reserved for future use **/
  __IO uint32_t    PCGCCTL;           /**< Power and Clock Gating Control Register  */

  uint32_t         RESERVED20[127];   /**< Reserved registers */
  __IO uint32_t    FIFO0D[512];       /**< Device EP 0/Host Channel 0 FIFO  */

  uint32_t         RESERVED21[512];   /**< Reserved registers */
  __IO uint32_t    FIFO1D[512];       /**< Device EP 1/Host Channel 1 FIFO  */

  uint32_t         RESERVED22[512];   /**< Reserved registers */
  __IO uint32_t    FIFO2D[512];       /**< Device EP 2/Host Channel 2 FIFO  */

  uint32_t         RESERVED23[512];   /**< Reserved registers */
  __IO uint32_t    FIFO3D[512];       /**< Device EP 3/Host Channel 3 FIFO  */

  uint32_t         RESERVED24[512];   /**< Reserved registers */
  __IO uint32_t    FIFO4D[512];       /**< Device EP 4/Host Channel 4 FIFO  */

  uint32_t         RESERVED25[512];   /**< Reserved registers */
  __IO uint32_t    FIFO5D[512];       /**< Device EP 5/Host Channel 5 FIFO  */

  uint32_t         RESERVED26[512];   /**< Reserved registers */
  __IO uint32_t    FIFO6D[512];       /**< Device EP 6/Host Channel 6 FIFO  */

  uint32_t         RESERVED27[512];   /**< Reserved registers */
  __IO uint32_t    FIFO7D[512];       /**< Host Channel 7 FIFO  */

  uint32_t         RESERVED28[512];   /**< Reserved registers */
  __IO uint32_t    FIFO8D[512];       /**< Host Channel 8 FIFO  */

  uint32_t         RESERVED29[512];   /**< Reserved registers */
  __IO uint32_t    FIFO9D[512];       /**< Host Channel 9 FIFO  */

  uint32_t         RESERVED30[512];   /**< Reserved registers */
  __IO uint32_t    FIFO10D[512];      /**< Host Channel 10 FIFO  */

  uint32_t         RESERVED31[512];   /**< Reserved registers */
  __IO uint32_t    FIFO11D[512];      /**< Host Channel 11 FIFO  */

  uint32_t         RESERVED32[512];   /**< Reserved registers */
  __IO uint32_t    FIFO12D[512];      /**< Host Channel 12 FIFO  */

  uint32_t         RESERVED33[512];   /**< Reserved registers */
  __IO uint32_t    FIFO13D[512];      /**< Host Channel 13 FIFO  */

  uint32_t         RESERVED34[17920]; /**< Reserved registers */
  __IO uint32_t    FIFORAM[512];      /**< Direct Access to Data FIFO RAM for Debugging (2 KB)  */
} USB_TypeDef;                        /** @} */

/**************************************************************************//**
 * @brief MSC_CACHE EFM32LGFULL MSC CACHE
 *****************************************************************************/
typedef struct
{
  __IO uint32_t DATA; /**< Cache Data  */
} MSC_CACHE_TypeDef;

/**************************************************************************//**
 * @defgroup EFM32LGFULL_MSC EFM32LGFULL MSC
 * @{
 * @brief EFM32LGFULL_MSC Register Declaration
 *****************************************************************************/
typedef struct
{
  __IO uint32_t     CTRL;           /**< Memory System Control Register  */
  __IO uint32_t     READCTRL;       /**< Read Control Register  */
  __IO uint32_t     WRITECTRL;      /**< Write Control Register  */
  __IO uint32_t     WRITECMD;       /**< Write Command Register  */
  __IO uint32_t     ADDRB;          /**< Page Erase/Write Address Buffer  */
  __I uint32_t      ADDR;           /**< Page Erase/Write Address Register  */
  __IO uint32_t     WDATA;          /**< Write Data Register  */
  __I uint32_t      STATUS;         /**< Status Register  */
  __IO uint32_t     MEMFEATURE;     /**< Memory Feature Config Register  */
  __IO uint32_t     CFGFEATURE;     /**< Configuration Pages Register  */
  __IO uint32_t     DEBUGLOCK;      /**< Debug Lock Register  */
  __I uint32_t      IF;             /**< Interrupt Flag Register  */
  __IO uint32_t     IFS;            /**< Interrupt Flag Set Register  */
  __IO uint32_t     IFC;            /**< Interrupt Flag Clear Register  */
  __IO uint32_t     IEN;            /**< Interrupt Enable Register  */
  __IO uint32_t     LOCK;           /**< Configuration Lock Register  */
  __IO uint32_t     CMD;            /**< Command Register  */
  __I uint32_t      CACHEHITS;      /**< Cache Hits Performance Counter  */
  __I uint32_t      CACHEMISSES;    /**< Cache Misses Performance Counter  */
  uint32_t          RESERVED0[1];   /**< Reserved for future use **/
  __IO uint32_t     TIMEBASE;       /**< Flash Write and Erase Timebase  */
  __IO uint32_t     MASSLOCK;       /**< Mass Erase Lock Register  */

  uint32_t          RESERVED1[2];   /**< Reserved for future use **/
  __IO uint32_t     TEST;           /**< Test register  */

  uint32_t          RESERVED2[103]; /**< Reserved registers */
  MSC_CACHE_TypeDef CACHE[128];     /**< Cache Memory */
} MSC_TypeDef;                      /** @} */

/**************************************************************************//**
 * @defgroup EFM32LGFULL_EMU EFM32LGFULL EMU
 * @{
 * @brief EFM32LGFULL_EMU Register Declaration
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL;             /**< Control Register  */

  uint32_t      RESERVED0[1];     /**< Reserved for future use **/
  __IO uint32_t LOCK;             /**< Configuration Lock Register  */
  __IO uint32_t BIASCONF;         /**< Configurations Related to the Bias  */
  __I uint32_t  BIASSTATUS;       /**< Status related to the BIAS  */
  __IO uint32_t TESTCTRL;         /**< Test Control Register  */
  __IO uint32_t ATESTCTRL;        /**< Analog Test Control Register  */
  __IO uint32_t ANACONF;          /**< Analog configuration bits  */
  __IO uint32_t DREGCONF;         /**< Configurations related to the DREG  */
  __IO uint32_t AUXCTRL;          /**< Auxiliary Control Register  */
  __IO uint32_t MEMFEATURE;       /**< Memory Feature Config Register  */
  __IO uint32_t EM4CONF;          /**< Energy mode 4 configuration register  */
  __IO uint32_t BUCTRL;           /**< Backup Power configuration register  */
  __IO uint32_t PWRCONF;          /**< Power connection configuration register  */
  __IO uint32_t BUINACT;          /**< Backup mode inactive configuration register  */
  __IO uint32_t BUACT;            /**< Backup mode active configuration register  */
  __I uint32_t  STATUS;           /**< Status register  */
  __IO uint32_t ROUTE;            /**< I/O Routing Register  */
  __I uint32_t  IF;               /**< Interrupt Flag Register  */
  __IO uint32_t IFS;              /**< Interrupt Flag Set Register  */
  __IO uint32_t IFC;              /**< Interrupt Flag Clear Register  */
  __IO uint32_t IEN;              /**< Interrupt Enable Register  */
  __IO uint32_t BUBODBUVINCAL;    /**< BU_VIN Backup BOD calibration  */
  __IO uint32_t BUBODUNREGCAL;    /**< Unregulated power Backup BOD calibration  */
  __IO uint32_t BUBODDECOUPLECAL; /**< DECOUPLE Backup BOD calibration  */
  __IO uint32_t EM4CALIB;         /**< EM4 Calibration  */
} EMU_TypeDef;                    /** @} */

/**************************************************************************//**
 * @defgroup EFM32LGFULL_RMU EFM32LGFULL RMU
 * @{
 * @brief EFM32LGFULL_RMU Register Declaration
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL;         /**< Control Register  */
  __I uint32_t  RSTCAUSE;     /**< Reset Cause Register  */
  __O uint32_t  CMD;          /**< Command Register  */
  __IO uint32_t PORBODCONFIG; /**< Porbod Configuration Register  */
} RMU_TypeDef;                /** @} */

/**************************************************************************//**
 * @defgroup EFM32LGFULL_CMU EFM32LGFULL CMU
 * @{
 * @brief EFM32LGFULL_CMU Register Declaration
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL;             /**< CMU Control Register  */
  __IO uint32_t HFCORECLKDIV;     /**< High Frequency Core Clock Division Register  */
  __IO uint32_t HFPERCLKDIV;      /**< High Frequency Peripheral Clock Division Register  */
  __IO uint32_t HFRCOCTRL;        /**< HFRCO Control Register  */
  __IO uint32_t LFRCOCTRL;        /**< LFRCO Control Register  */
  __IO uint32_t AUXHFRCOCTRL;     /**< AUXHFRCO Control Register  */
  __IO uint32_t CALCTRL;          /**< Calibration Control Register  */
  __IO uint32_t CALCNT;           /**< Calibration Counter Register  */
  __IO uint32_t OSCENCMD;         /**< Oscillator Enable/Disable Command Register  */
  __IO uint32_t CMD;              /**< Command Register  */
  __IO uint32_t LFCLKSEL;         /**< Low Frequency Clock Select Register  */
  __I uint32_t  STATUS;           /**< Status Register  */
  __I uint32_t  IF;               /**< Interrupt Flag Register  */
  __IO uint32_t IFS;              /**< Interrupt Flag Set Register  */
  __IO uint32_t IFC;              /**< Interrupt Flag Clear Register  */
  __IO uint32_t IEN;              /**< Interrupt Enable Register  */
  __IO uint32_t HFCORECLKEN0;     /**< High Frequency Core Clock Enable Register 0  */
  __IO uint32_t HFPERCLKEN0;      /**< High Frequency Peripheral Clock Enable Register 0  */
  uint32_t      RESERVED0[2];     /**< Reserved for future use **/
  __I uint32_t  SYNCBUSY;         /**< Synchronization Busy Register  */
  __IO uint32_t FREEZE;           /**< Freeze Register  */
  __IO uint32_t LFACLKEN0;        /**< Low Frequency A Clock Enable Register 0  (Async Reg)  */
  uint32_t      RESERVED1[1];     /**< Reserved for future use **/
  __IO uint32_t LFBCLKEN0;        /**< Low Frequency B Clock Enable Register 0 (Async Reg)  */

  uint32_t      RESERVED2[1];     /**< Reserved for future use **/
  __IO uint32_t LFAPRESC0;        /**< Low Frequency A Prescaler Register 0 (Async Reg)  */
  uint32_t      RESERVED3[1];     /**< Reserved for future use **/
  __IO uint32_t LFBPRESC0;        /**< Low Frequency B Prescaler Register 0  (Async Reg)  */
  uint32_t      RESERVED4[1];     /**< Reserved for future use **/
  __IO uint32_t PCNTCTRL;         /**< PCNT Control Register  */
  __IO uint32_t LCDCTRL;          /**< LCD Control Register  */
  __IO uint32_t ROUTE;            /**< I/O Routing Register  */
  __IO uint32_t LOCK;             /**< Configuration Lock Register  */
  __IO uint32_t HFCORECLKENMASK0; /**< High Frequency Core Clock Lock  */
  __IO uint32_t HFPERCLKENMASK0;  /**< High Frequency Peripheral Clock Lock  */
  uint32_t      RESERVED5[2];     /**< Reserved for future use **/
  __IO uint32_t LFACLKENMASK0;    /**< Low Frequency A Clock Lock  */
  uint32_t      RESERVED6[1];     /**< Reserved for future use **/
  __IO uint32_t LFBCLKENMASK0;    /**< Low Frequency B Clock Lock  */

