ARMmbed/DAPLink/source/common/cmsis-core/siliconlabs/efm32lg/efm32lgfull.h
/* Bit fields for DMA CHNLDONECLR */
#define _DMA_CHNLDONECLR_RESETVALUE                     0x00000000UL                                /**< Default value for DMA_CHNLDONECLR */
#define _DMA_CHNLDONECLR_MASK                           0xFFFFFFFFUL                                /**< Mask for DMA_CHNLDONECLR */
#define _DMA_CHNLDONECLR_CHNLDONECLR_SHIFT              0                                           /**< Shift value for DMA_CHNLDONECLR */
#define _DMA_CHNLDONECLR_CHNLDONECLR_MASK               0xFFFFFFFFUL                                /**< Bit mask for DMA_CHNLDONECLR */
#define _DMA_CHNLDONECLR_CHNLDONECLR_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for DMA_CHNLDONECLR */
#define DMA_CHNLDONECLR_CHNLDONECLR_DEFAULT             (_DMA_CHNLDONECLR_CHNLDONECLR_DEFAULT << 0) /**< Shifted mode DEFAULT for DMA_CHNLDONECLR */

/* Bit fields for DMA CHNLACTIVESET */
#define _DMA_CHNLACTIVESET_RESETVALUE                   0x00000000UL                                    /**< Default value for DMA_CHNLACTIVESET */
#define _DMA_CHNLACTIVESET_MASK                         0xFFFFFFFFUL                                    /**< Mask for DMA_CHNLACTIVESET */
#define _DMA_CHNLACTIVESET_CHNLACTIVESET_SHIFT          0                                               /**< Shift value for DMA_CHNLACTIVESET */
#define _DMA_CHNLACTIVESET_CHNLACTIVESET_MASK           0xFFFFFFFFUL                                    /**< Bit mask for DMA_CHNLACTIVESET */
#define _DMA_CHNLACTIVESET_CHNLACTIVESET_DEFAULT        0x00000000UL                                    /**< Mode DEFAULT for DMA_CHNLACTIVESET */
#define DMA_CHNLACTIVESET_CHNLACTIVESET_DEFAULT         (_DMA_CHNLACTIVESET_CHNLACTIVESET_DEFAULT << 0) /**< Shifted mode DEFAULT for DMA_CHNLACTIVESET */

/* Bit fields for DMA CHNLACTIVECLR */
#define _DMA_CHNLACTIVECLR_RESETVALUE                   0x00000000UL                                    /**< Default value for DMA_CHNLACTIVECLR */
#define _DMA_CHNLACTIVECLR_MASK                         0xFFFFFFFFUL                                    /**< Mask for DMA_CHNLACTIVECLR */
#define _DMA_CHNLACTIVECLR_CHNLACTIVECLR_SHIFT          0                                               /**< Shift value for DMA_CHNLACTIVECLR */
#define _DMA_CHNLACTIVECLR_CHNLACTIVECLR_MASK           0xFFFFFFFFUL                                    /**< Bit mask for DMA_CHNLACTIVECLR */
#define _DMA_CHNLACTIVECLR_CHNLACTIVECLR_DEFAULT        0x00000000UL                                    /**< Mode DEFAULT for DMA_CHNLACTIVECLR */
#define DMA_CHNLACTIVECLR_CHNLACTIVECLR_DEFAULT         (_DMA_CHNLACTIVECLR_CHNLACTIVECLR_DEFAULT << 0) /**< Shifted mode DEFAULT for DMA_CHNLACTIVECLR */

/* Bit fields for DMA ERRSET */
#define _DMA_ERRSET_RESETVALUE                          0x00000000UL                      /**< Default value for DMA_ERRSET */
#define _DMA_ERRSET_MASK                                0x00000001UL                      /**< Mask for DMA_ERRSET */
#define DMA_ERRSET_ERRSET                               (0x1UL << 0)                      /**<  */
#define _DMA_ERRSET_ERRSET_SHIFT                        0                                 /**< Shift value for DMA_ERRSET */
#define _DMA_ERRSET_ERRSET_MASK                         0x1UL                             /**< Bit mask for DMA_ERRSET */
#define _DMA_ERRSET_ERRSET_DEFAULT                      0x00000000UL                      /**< Mode DEFAULT for DMA_ERRSET */
#define DMA_ERRSET_ERRSET_DEFAULT                       (_DMA_ERRSET_ERRSET_DEFAULT << 0) /**< Shifted mode DEFAULT for DMA_ERRSET */

/* Bit fields for DMA IF */
#define _DMA_IF_RESETVALUE                              0x00000000UL                     /**< Default value for DMA_IF */
#define _DMA_IF_MASK                                    0x80000FFFUL                     /**< Mask for DMA_IF */
#define DMA_IF_CH0DONE                                  (0x1UL << 0)                     /**< DMA Channel 0 Complete Interrupt Flag */
#define _DMA_IF_CH0DONE_SHIFT                           0                                /**< Shift value for DMA_CH0DONE */
#define _DMA_IF_CH0DONE_MASK                            0x1UL                            /**< Bit mask for DMA_CH0DONE */
#define _DMA_IF_CH0DONE_DEFAULT                         0x00000000UL                     /**< Mode DEFAULT for DMA_IF */
#define DMA_IF_CH0DONE_DEFAULT                          (_DMA_IF_CH0DONE_DEFAULT << 0)   /**< Shifted mode DEFAULT for DMA_IF */
#define DMA_IF_CH1DONE                                  (0x1UL << 1)                     /**< DMA Channel 1 Complete Interrupt Flag */
#define _DMA_IF_CH1DONE_SHIFT                           1                                /**< Shift value for DMA_CH1DONE */
#define _DMA_IF_CH1DONE_MASK                            0x2UL                            /**< Bit mask for DMA_CH1DONE */
#define _DMA_IF_CH1DONE_DEFAULT                         0x00000000UL                     /**< Mode DEFAULT for DMA_IF */
#define DMA_IF_CH1DONE_DEFAULT                          (_DMA_IF_CH1DONE_DEFAULT << 1)   /**< Shifted mode DEFAULT for DMA_IF */
#define DMA_IF_CH2DONE                                  (0x1UL << 2)                     /**< DMA Channel 2 Complete Interrupt Flag */
#define _DMA_IF_CH2DONE_SHIFT                           2                                /**< Shift value for DMA_CH2DONE */
#define _DMA_IF_CH2DONE_MASK                            0x4UL                            /**< Bit mask for DMA_CH2DONE */
#define _DMA_IF_CH2DONE_DEFAULT                         0x00000000UL                     /**< Mode DEFAULT for DMA_IF */
#define DMA_IF_CH2DONE_DEFAULT                          (_DMA_IF_CH2DONE_DEFAULT << 2)   /**< Shifted mode DEFAULT for DMA_IF */
#define DMA_IF_CH3DONE                                  (0x1UL << 3)                     /**< DMA Channel 3 Complete Interrupt Flag */
#define _DMA_IF_CH3DONE_SHIFT                           3                                /**< Shift value for DMA_CH3DONE */
#define _DMA_IF_CH3DONE_MASK                            0x8UL                            /**< Bit mask for DMA_CH3DONE */
#define _DMA_IF_CH3DONE_DEFAULT                         0x00000000UL                     /**< Mode DEFAULT for DMA_IF */
#define DMA_IF_CH3DONE_DEFAULT                          (_DMA_IF_CH3DONE_DEFAULT << 3)   /**< Shifted mode DEFAULT for DMA_IF */
#define DMA_IF_CH4DONE                                  (0x1UL << 4)                     /**< DMA Channel 4 Complete Interrupt Flag */
#define _DMA_IF_CH4DONE_SHIFT                           4                                /**< Shift value for DMA_CH4DONE */
#define _DMA_IF_CH4DONE_MASK                            0x10UL                           /**< Bit mask for DMA_CH4DONE */
#define _DMA_IF_CH4DONE_DEFAULT                         0x00000000UL                     /**< Mode DEFAULT for DMA_IF */
#define DMA_IF_CH4DONE_DEFAULT                          (_DMA_IF_CH4DONE_DEFAULT << 4)   /**< Shifted mode DEFAULT for DMA_IF */
#define DMA_IF_CH5DONE                                  (0x1UL << 5)                     /**< DMA Channel 5 Complete Interrupt Flag */
#define _DMA_IF_CH5DONE_SHIFT                           5                                /**< Shift value for DMA_CH5DONE */
#define _DMA_IF_CH5DONE_MASK                            0x20UL                           /**< Bit mask for DMA_CH5DONE */
#define _DMA_IF_CH5DONE_DEFAULT                         0x00000000UL                     /**< Mode DEFAULT for DMA_IF */
#define DMA_IF_CH5DONE_DEFAULT                          (_DMA_IF_CH5DONE_DEFAULT << 5)   /**< Shifted mode DEFAULT for DMA_IF */
#define DMA_IF_CH6DONE                                  (0x1UL << 6)                     /**< DMA Channel 6 Complete Interrupt Flag */
#define _DMA_IF_CH6DONE_SHIFT                           6                                /**< Shift value for DMA_CH6DONE */
#define _DMA_IF_CH6DONE_MASK                            0x40UL                           /**< Bit mask for DMA_CH6DONE */
#define _DMA_IF_CH6DONE_DEFAULT                         0x00000000UL                     /**< Mode DEFAULT for DMA_IF */
#define DMA_IF_CH6DONE_DEFAULT                          (_DMA_IF_CH6DONE_DEFAULT << 6)   /**< Shifted mode DEFAULT for DMA_IF */
#define DMA_IF_CH7DONE                                  (0x1UL << 7)                     /**< DMA Channel 7 Complete Interrupt Flag */
#define _DMA_IF_CH7DONE_SHIFT                           7                                /**< Shift value for DMA_CH7DONE */
#define _DMA_IF_CH7DONE_MASK                            0x80UL                           /**< Bit mask for DMA_CH7DONE */
#define _DMA_IF_CH7DONE_DEFAULT                         0x00000000UL                     /**< Mode DEFAULT for DMA_IF */
#define DMA_IF_CH7DONE_DEFAULT                          (_DMA_IF_CH7DONE_DEFAULT << 7)   /**< Shifted mode DEFAULT for DMA_IF */
#define DMA_IF_CH8DONE                                  (0x1UL << 8)                     /**< DMA Channel 8 Complete Interrupt Flag */
#define _DMA_IF_CH8DONE_SHIFT                           8                                /**< Shift value for DMA_CH8DONE */
#define _DMA_IF_CH8DONE_MASK                            0x100UL                          /**< Bit mask for DMA_CH8DONE */
#define _DMA_IF_CH8DONE_DEFAULT                         0x00000000UL                     /**< Mode DEFAULT for DMA_IF */
#define DMA_IF_CH8DONE_DEFAULT                          (_DMA_IF_CH8DONE_DEFAULT << 8)   /**< Shifted mode DEFAULT for DMA_IF */
#define DMA_IF_CH9DONE                                  (0x1UL << 9)                     /**< DMA Channel 9 Complete Interrupt Flag */
#define _DMA_IF_CH9DONE_SHIFT                           9                                /**< Shift value for DMA_CH9DONE */
#define _DMA_IF_CH9DONE_MASK                            0x200UL                          /**< Bit mask for DMA_CH9DONE */
#define _DMA_IF_CH9DONE_DEFAULT                         0x00000000UL                     /**< Mode DEFAULT for DMA_IF */
#define DMA_IF_CH9DONE_DEFAULT                          (_DMA_IF_CH9DONE_DEFAULT << 9)   /**< Shifted mode DEFAULT for DMA_IF */
#define DMA_IF_CH10DONE                                 (0x1UL << 10)                    /**< DMA Channel 10 Complete Interrupt Flag */
#define _DMA_IF_CH10DONE_SHIFT                          10                               /**< Shift value for DMA_CH10DONE */
#define _DMA_IF_CH10DONE_MASK                           0x400UL                          /**< Bit mask for DMA_CH10DONE */
#define _DMA_IF_CH10DONE_DEFAULT                        0x00000000UL                     /**< Mode DEFAULT for DMA_IF */
#define DMA_IF_CH10DONE_DEFAULT                         (_DMA_IF_CH10DONE_DEFAULT << 10) /**< Shifted mode DEFAULT for DMA_IF */
#define DMA_IF_CH11DONE                                 (0x1UL << 11)                    /**< DMA Channel 11 Complete Interrupt Flag */
#define _DMA_IF_CH11DONE_SHIFT                          11                               /**< Shift value for DMA_CH11DONE */
#define _DMA_IF_CH11DONE_MASK                           0x800UL                          /**< Bit mask for DMA_CH11DONE */
#define _DMA_IF_CH11DONE_DEFAULT                        0x00000000UL                     /**< Mode DEFAULT for DMA_IF */
#define DMA_IF_CH11DONE_DEFAULT                         (_DMA_IF_CH11DONE_DEFAULT << 11) /**< Shifted mode DEFAULT for DMA_IF */
#define DMA_IF_ERR                                      (0x1UL << 31)                    /**< DMA Error Interrupt Flag */
#define _DMA_IF_ERR_SHIFT                               31                               /**< Shift value for DMA_ERR */
#define _DMA_IF_ERR_MASK                                0x80000000UL                     /**< Bit mask for DMA_ERR */
#define _DMA_IF_ERR_DEFAULT                             0x00000000UL                     /**< Mode DEFAULT for DMA_IF */
#define DMA_IF_ERR_DEFAULT                              (_DMA_IF_ERR_DEFAULT << 31)      /**< Shifted mode DEFAULT for DMA_IF */

