ARMmbed/DAPLink/source/common/cmsis-core/siliconlabs/efm32lg/efm32lgfull.h
/* Bit fields for MSC CFGFEATURE */
#define _MSC_CFGFEATURE_RESETVALUE               0x00000000UL                             /**< Default value for MSC_CFGFEATURE */
#define _MSC_CFGFEATURE_MASK                     0x00000001UL                             /**< Mask for MSC_CFGFEATURE */
#define MSC_CFGFEATURE_CFGLOCKEN                 (0x1UL << 0)                             /**< Feature Configuration and Device Information Pages Lock */
#define _MSC_CFGFEATURE_CFGLOCKEN_SHIFT          0                                        /**< Shift value for MSC_CFGLOCKEN */
#define _MSC_CFGFEATURE_CFGLOCKEN_MASK           0x1UL                                    /**< Bit mask for MSC_CFGLOCKEN */
#define _MSC_CFGFEATURE_CFGLOCKEN_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for MSC_CFGFEATURE */
#define MSC_CFGFEATURE_CFGLOCKEN_DEFAULT         (_MSC_CFGFEATURE_CFGLOCKEN_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_CFGFEATURE */

/* Bit fields for MSC DEBUGLOCK */
#define _MSC_DEBUGLOCK_RESETVALUE                0x00000000UL                          /**< Default value for MSC_DEBUGLOCK */
#define _MSC_DEBUGLOCK_MASK                      0x00000001UL                          /**< Mask for MSC_DEBUGLOCK */
#define MSC_DEBUGLOCK_DEBUGEN                    (0x1UL << 0)                          /**< Enable Debug Access */
#define _MSC_DEBUGLOCK_DEBUGEN_SHIFT             0                                     /**< Shift value for MSC_DEBUGEN */
#define _MSC_DEBUGLOCK_DEBUGEN_MASK              0x1UL                                 /**< Bit mask for MSC_DEBUGEN */
#define _MSC_DEBUGLOCK_DEBUGEN_DEFAULT           0x00000000UL                          /**< Mode DEFAULT for MSC_DEBUGLOCK */
#define MSC_DEBUGLOCK_DEBUGEN_DEFAULT            (_MSC_DEBUGLOCK_DEBUGEN_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_DEBUGLOCK */

/* Bit fields for MSC IF */
#define _MSC_IF_RESETVALUE                       0x00000000UL                 /**< Default value for MSC_IF */
#define _MSC_IF_MASK                             0x0000000FUL                 /**< Mask for MSC_IF */
#define MSC_IF_ERASE                             (0x1UL << 0)                 /**< Erase Done Interrupt Read Flag */
#define _MSC_IF_ERASE_SHIFT                      0                            /**< Shift value for MSC_ERASE */
#define _MSC_IF_ERASE_MASK                       0x1UL                        /**< Bit mask for MSC_ERASE */
#define _MSC_IF_ERASE_DEFAULT                    0x00000000UL                 /**< Mode DEFAULT for MSC_IF */
#define MSC_IF_ERASE_DEFAULT                     (_MSC_IF_ERASE_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_IF */
#define MSC_IF_WRITE                             (0x1UL << 1)                 /**< Write Done Interrupt Read Flag */
#define _MSC_IF_WRITE_SHIFT                      1                            /**< Shift value for MSC_WRITE */
#define _MSC_IF_WRITE_MASK                       0x2UL                        /**< Bit mask for MSC_WRITE */
#define _MSC_IF_WRITE_DEFAULT                    0x00000000UL                 /**< Mode DEFAULT for MSC_IF */
#define MSC_IF_WRITE_DEFAULT                     (_MSC_IF_WRITE_DEFAULT << 1) /**< Shifted mode DEFAULT for MSC_IF */
#define MSC_IF_CHOF                              (0x1UL << 2)                 /**< Cache Hits Overflow Interrupt Flag */
#define _MSC_IF_CHOF_SHIFT                       2                            /**< Shift value for MSC_CHOF */
#define _MSC_IF_CHOF_MASK                        0x4UL                        /**< Bit mask for MSC_CHOF */
#define _MSC_IF_CHOF_DEFAULT                     0x00000000UL                 /**< Mode DEFAULT for MSC_IF */
#define MSC_IF_CHOF_DEFAULT                      (_MSC_IF_CHOF_DEFAULT << 2)  /**< Shifted mode DEFAULT for MSC_IF */
#define MSC_IF_CMOF                              (0x1UL << 3)                 /**< Cache Misses Overflow Interrupt Flag */
#define _MSC_IF_CMOF_SHIFT                       3                            /**< Shift value for MSC_CMOF */
#define _MSC_IF_CMOF_MASK                        0x8UL                        /**< Bit mask for MSC_CMOF */
#define _MSC_IF_CMOF_DEFAULT                     0x00000000UL                 /**< Mode DEFAULT for MSC_IF */
#define MSC_IF_CMOF_DEFAULT                      (_MSC_IF_CMOF_DEFAULT << 3)  /**< Shifted mode DEFAULT for MSC_IF */

/* Bit fields for MSC IFS */
#define _MSC_IFS_RESETVALUE                      0x00000000UL                  /**< Default value for MSC_IFS */
#define _MSC_IFS_MASK                            0x0000000FUL                  /**< Mask for MSC_IFS */
#define MSC_IFS_ERASE                            (0x1UL << 0)                  /**< Erase Done Interrupt Set */
#define _MSC_IFS_ERASE_SHIFT                     0                             /**< Shift value for MSC_ERASE */
#define _MSC_IFS_ERASE_MASK                      0x1UL                         /**< Bit mask for MSC_ERASE */
#define _MSC_IFS_ERASE_DEFAULT                   0x00000000UL                  /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_ERASE_DEFAULT                    (_MSC_IFS_ERASE_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_WRITE                            (0x1UL << 1)                  /**< Write Done Interrupt Set */
#define _MSC_IFS_WRITE_SHIFT                     1                             /**< Shift value for MSC_WRITE */
#define _MSC_IFS_WRITE_MASK                      0x2UL                         /**< Bit mask for MSC_WRITE */
#define _MSC_IFS_WRITE_DEFAULT                   0x00000000UL                  /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_WRITE_DEFAULT                    (_MSC_IFS_WRITE_DEFAULT << 1) /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_CHOF                             (0x1UL << 2)                  /**< Cache Hits Overflow Interrupt Set */
#define _MSC_IFS_CHOF_SHIFT                      2                             /**< Shift value for MSC_CHOF */
#define _MSC_IFS_CHOF_MASK                       0x4UL                         /**< Bit mask for MSC_CHOF */
#define _MSC_IFS_CHOF_DEFAULT                    0x00000000UL                  /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_CHOF_DEFAULT                     (_MSC_IFS_CHOF_DEFAULT << 2)  /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_CMOF                             (0x1UL << 3)                  /**< Cache Misses Overflow Interrupt Set */
#define _MSC_IFS_CMOF_SHIFT                      3                             /**< Shift value for MSC_CMOF */
#define _MSC_IFS_CMOF_MASK                       0x8UL                         /**< Bit mask for MSC_CMOF */
#define _MSC_IFS_CMOF_DEFAULT                    0x00000000UL                  /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_CMOF_DEFAULT                     (_MSC_IFS_CMOF_DEFAULT << 3)  /**< Shifted mode DEFAULT for MSC_IFS */

/* Bit fields for MSC IFC */
#define _MSC_IFC_RESETVALUE                      0x00000000UL                  /**< Default value for MSC_IFC */
#define _MSC_IFC_MASK                            0x0000000FUL                  /**< Mask for MSC_IFC */
#define MSC_IFC_ERASE                            (0x1UL << 0)                  /**< Erase Done Interrupt Clear */
#define _MSC_IFC_ERASE_SHIFT                     0                             /**< Shift value for MSC_ERASE */
#define _MSC_IFC_ERASE_MASK                      0x1UL                         /**< Bit mask for MSC_ERASE */
#define _MSC_IFC_ERASE_DEFAULT                   0x00000000UL                  /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_ERASE_DEFAULT                    (_MSC_IFC_ERASE_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_WRITE                            (0x1UL << 1)                  /**< Write Done Interrupt Clear */
#define _MSC_IFC_WRITE_SHIFT                     1                             /**< Shift value for MSC_WRITE */
#define _MSC_IFC_WRITE_MASK                      0x2UL                         /**< Bit mask for MSC_WRITE */
#define _MSC_IFC_WRITE_DEFAULT                   0x00000000UL                  /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_WRITE_DEFAULT                    (_MSC_IFC_WRITE_DEFAULT << 1) /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_CHOF                             (0x1UL << 2)                  /**< Cache Hits Overflow Interrupt Clear */
#define _MSC_IFC_CHOF_SHIFT                      2                             /**< Shift value for MSC_CHOF */
#define _MSC_IFC_CHOF_MASK                       0x4UL                         /**< Bit mask for MSC_CHOF */
#define _MSC_IFC_CHOF_DEFAULT                    0x00000000UL                  /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_CHOF_DEFAULT                     (_MSC_IFC_CHOF_DEFAULT << 2)  /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_CMOF                             (0x1UL << 3)                  /**< Cache Misses Overflow Interrupt Clear */
#define _MSC_IFC_CMOF_SHIFT                      3                             /**< Shift value for MSC_CMOF */
#define _MSC_IFC_CMOF_MASK                       0x8UL                         /**< Bit mask for MSC_CMOF */
#define _MSC_IFC_CMOF_DEFAULT                    0x00000000UL                  /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_CMOF_DEFAULT                     (_MSC_IFC_CMOF_DEFAULT << 3)  /**< Shifted mode DEFAULT for MSC_IFC */

/* Bit fields for MSC IEN */
#define _MSC_IEN_RESETVALUE                      0x00000000UL                  /**< Default value for MSC_IEN */
#define _MSC_IEN_MASK                            0x0000000FUL                  /**< Mask for MSC_IEN */
#define MSC_IEN_ERASE                            (0x1UL << 0)                  /**< Erase Done Interrupt Enable */
#define _MSC_IEN_ERASE_SHIFT                     0                             /**< Shift value for MSC_ERASE */
#define _MSC_IEN_ERASE_MASK                      0x1UL                         /**< Bit mask for MSC_ERASE */
#define _MSC_IEN_ERASE_DEFAULT                   0x00000000UL                  /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_ERASE_DEFAULT                    (_MSC_IEN_ERASE_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_WRITE                            (0x1UL << 1)                  /**< Write Done Interrupt Enable */
#define _MSC_IEN_WRITE_SHIFT                     1                             /**< Shift value for MSC_WRITE */
#define _MSC_IEN_WRITE_MASK                      0x2UL                         /**< Bit mask for MSC_WRITE */
#define _MSC_IEN_WRITE_DEFAULT                   0x00000000UL                  /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_WRITE_DEFAULT                    (_MSC_IEN_WRITE_DEFAULT << 1) /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_CHOF                             (0x1UL << 2)                  /**< Cache Hits Overflow Interrupt Enable */
#define _MSC_IEN_CHOF_SHIFT                      2                             /**< Shift value for MSC_CHOF */
#define _MSC_IEN_CHOF_MASK                       0x4UL                         /**< Bit mask for MSC_CHOF */
#define _MSC_IEN_CHOF_DEFAULT                    0x00000000UL                  /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_CHOF_DEFAULT                     (_MSC_IEN_CHOF_DEFAULT << 2)  /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_CMOF                             (0x1UL << 3)                  /**< Cache Misses Overflow Interrupt Enable */
#define _MSC_IEN_CMOF_SHIFT                      3                             /**< Shift value for MSC_CMOF */
#define _MSC_IEN_CMOF_MASK                       0x8UL                         /**< Bit mask for MSC_CMOF */
#define _MSC_IEN_CMOF_DEFAULT                    0x00000000UL                  /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_CMOF_DEFAULT                     (_MSC_IEN_CMOF_DEFAULT << 3)  /**< Shifted mode DEFAULT for MSC_IEN */

/* Bit fields for MSC LOCK */
#define _MSC_LOCK_RESETVALUE                     0x00000000UL                      /**< Default value for MSC_LOCK */
#define _MSC_LOCK_MASK                           0x0000FFFFUL                      /**< Mask for MSC_LOCK */
#define _MSC_LOCK_LOCKKEY_SHIFT                  0                                 /**< Shift value for MSC_LOCKKEY */
#define _MSC_LOCK_LOCKKEY_MASK                   0xFFFFUL                          /**< Bit mask for MSC_LOCKKEY */
#define _MSC_LOCK_LOCKKEY_DEFAULT                0x00000000UL                      /**< Mode DEFAULT for MSC_LOCK */
#define _MSC_LOCK_LOCKKEY_LOCK                   0x00000000UL                      /**< Mode LOCK for MSC_LOCK */
#define _MSC_LOCK_LOCKKEY_UNLOCKED               0x00000000UL                      /**< Mode UNLOCKED for MSC_LOCK */
#define _MSC_LOCK_LOCKKEY_LOCKED                 0x00000001UL                      /**< Mode LOCKED for MSC_LOCK */
#define _MSC_LOCK_LOCKKEY_UNLOCK                 0x00001B71UL                      /**< Mode UNLOCK for MSC_LOCK */
#define MSC_LOCK_LOCKKEY_DEFAULT                 (_MSC_LOCK_LOCKKEY_DEFAULT << 0)  /**< Shifted mode DEFAULT for MSC_LOCK */
#define MSC_LOCK_LOCKKEY_LOCK                    (_MSC_LOCK_LOCKKEY_LOCK << 0)     /**< Shifted mode LOCK for MSC_LOCK */
#define MSC_LOCK_LOCKKEY_UNLOCKED                (_MSC_LOCK_LOCKKEY_UNLOCKED << 0) /**< Shifted mode UNLOCKED for MSC_LOCK */
#define MSC_LOCK_LOCKKEY_LOCKED                  (_MSC_LOCK_LOCKKEY_LOCKED << 0)   /**< Shifted mode LOCKED for MSC_LOCK */
#define MSC_LOCK_LOCKKEY_UNLOCK                  (_MSC_LOCK_LOCKKEY_UNLOCK << 0)   /**< Shifted mode UNLOCK for MSC_LOCK */

/* Bit fields for MSC CMD */
#define _MSC_CMD_RESETVALUE                      0x00000000UL                     /**< Default value for MSC_CMD */
#define _MSC_CMD_MASK                            0x00000007UL                     /**< Mask for MSC_CMD */
#define MSC_CMD_INVCACHE                         (0x1UL << 0)                     /**< Invalidate Instruction Cache */
#define _MSC_CMD_INVCACHE_SHIFT                  0                                /**< Shift value for MSC_INVCACHE */
#define _MSC_CMD_INVCACHE_MASK                   0x1UL                            /**< Bit mask for MSC_INVCACHE */
#define _MSC_CMD_INVCACHE_DEFAULT                0x00000000UL                     /**< Mode DEFAULT for MSC_CMD */
#define MSC_CMD_INVCACHE_DEFAULT                 (_MSC_CMD_INVCACHE_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_CMD */
#define MSC_CMD_STARTPC                          (0x1UL << 1)                     /**< Start Performance Counters */
#define _MSC_CMD_STARTPC_SHIFT                   1                                /**< Shift value for MSC_STARTPC */
#define _MSC_CMD_STARTPC_MASK                    0x2UL                            /**< Bit mask for MSC_STARTPC */
#define _MSC_CMD_STARTPC_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for MSC_CMD */
#define MSC_CMD_STARTPC_DEFAULT                  (_MSC_CMD_STARTPC_DEFAULT << 1)  /**< Shifted mode DEFAULT for MSC_CMD */
#define MSC_CMD_STOPPC                           (0x1UL << 2)                     /**< Stop Performance Counters */
#define _MSC_CMD_STOPPC_SHIFT                    2                                /**< Shift value for MSC_STOPPC */
#define _MSC_CMD_STOPPC_MASK                     0x4UL                            /**< Bit mask for MSC_STOPPC */
#define _MSC_CMD_STOPPC_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for MSC_CMD */
#define MSC_CMD_STOPPC_DEFAULT                   (_MSC_CMD_STOPPC_DEFAULT << 2)   /**< Shifted mode DEFAULT for MSC_CMD */

