ARMmbed/DAPLink/source/common/cmsis-core/siliconlabs/efm32lg/efm32lgfull.h
/* Bit fields for EMU TESTCTRL */
#define _EMU_TESTCTRL_RESETVALUE                            0x00000000UL                                 /**< Default value for EMU_TESTCTRL */
#define _EMU_TESTCTRL_MASK                                  0x000003FFUL                                 /**< Mask for EMU_TESTCTRL */
#define EMU_TESTCTRL_TM_CLK                                 (0x1UL << 0)                                 /**< Test Mode Clock */
#define _EMU_TESTCTRL_TM_CLK_SHIFT                          0                                            /**< Shift value for EMU_TM_CLK */
#define _EMU_TESTCTRL_TM_CLK_MASK                           0x1UL                                        /**< Bit mask for EMU_TM_CLK */
#define _EMU_TESTCTRL_TM_CLK_DEFAULT                        0x00000000UL                                 /**< Mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_TM_CLK_DEFAULT                         (_EMU_TESTCTRL_TM_CLK_DEFAULT << 0)          /**< Shifted mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_TM_RESET_N                             (0x1UL << 1)                                 /**< Test Mode Reset */
#define _EMU_TESTCTRL_TM_RESET_N_SHIFT                      1                                            /**< Shift value for EMU_TM_RESET_N */
#define _EMU_TESTCTRL_TM_RESET_N_MASK                       0x2UL                                        /**< Bit mask for EMU_TM_RESET_N */
#define _EMU_TESTCTRL_TM_RESET_N_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_TM_RESET_N_DEFAULT                     (_EMU_TESTCTRL_TM_RESET_N_DEFAULT << 1)      /**< Shifted mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_INT_BOD_RST_DIS                        (0x1UL << 2)                                 /**< Set to mask out internal BOD */
#define _EMU_TESTCTRL_INT_BOD_RST_DIS_SHIFT                 2                                            /**< Shift value for EMU_INT_BOD_RST_DIS */
#define _EMU_TESTCTRL_INT_BOD_RST_DIS_MASK                  0x4UL                                        /**< Bit mask for EMU_INT_BOD_RST_DIS */
#define _EMU_TESTCTRL_INT_BOD_RST_DIS_DEFAULT               0x00000000UL                                 /**< Mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_INT_BOD_RST_DIS_DEFAULT                (_EMU_TESTCTRL_INT_BOD_RST_DIS_DEFAULT << 2) /**< Shifted mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_EXT_BOD_RST_DIS                        (0x1UL << 3)                                 /**< Set to mask out external BOD */
#define _EMU_TESTCTRL_EXT_BOD_RST_DIS_SHIFT                 3                                            /**< Shift value for EMU_EXT_BOD_RST_DIS */
#define _EMU_TESTCTRL_EXT_BOD_RST_DIS_MASK                  0x8UL                                        /**< Bit mask for EMU_EXT_BOD_RST_DIS */
#define _EMU_TESTCTRL_EXT_BOD_RST_DIS_DEFAULT               0x00000000UL                                 /**< Mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_EXT_BOD_RST_DIS_DEFAULT                (_EMU_TESTCTRL_EXT_BOD_RST_DIS_DEFAULT << 3) /**< Shifted mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_EXPORT_RESET                           (0x1UL << 4)                                 /**< Set to export reset sources */
#define _EMU_TESTCTRL_EXPORT_RESET_SHIFT                    4                                            /**< Shift value for EMU_EXPORT_RESET */
#define _EMU_TESTCTRL_EXPORT_RESET_MASK                     0x10UL                                       /**< Bit mask for EMU_EXPORT_RESET */
#define _EMU_TESTCTRL_EXPORT_RESET_DEFAULT                  0x00000000UL                                 /**< Mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_EXPORT_RESET_DEFAULT                   (_EMU_TESTCTRL_EXPORT_RESET_DEFAULT << 4)    /**< Shifted mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_SCANTEST_EN                            (0x1UL << 5)                                 /**< Set to enable scan */
#define _EMU_TESTCTRL_SCANTEST_EN_SHIFT                     5                                            /**< Shift value for EMU_SCANTEST_EN */
#define _EMU_TESTCTRL_SCANTEST_EN_MASK                      0x20UL                                       /**< Bit mask for EMU_SCANTEST_EN */
#define _EMU_TESTCTRL_SCANTEST_EN_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_SCANTEST_EN_DEFAULT                    (_EMU_TESTCTRL_SCANTEST_EN_DEFAULT << 5)     /**< Shifted mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_SCAN_PIN_MODE                          (0x1UL << 6)                                 /**< Set Scan Pins */
#define _EMU_TESTCTRL_SCAN_PIN_MODE_SHIFT                   6                                            /**< Shift value for EMU_SCAN_PIN_MODE */
#define _EMU_TESTCTRL_SCAN_PIN_MODE_MASK                    0x40UL                                       /**< Bit mask for EMU_SCAN_PIN_MODE */
#define _EMU_TESTCTRL_SCAN_PIN_MODE_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_SCAN_PIN_MODE_DEFAULT                  (_EMU_TESTCTRL_SCAN_PIN_MODE_DEFAULT << 6)   /**< Shifted mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_GMC_CALIB_START                        (0x1UL << 7)                                 /**< gmc calibration start */
#define _EMU_TESTCTRL_GMC_CALIB_START_SHIFT                 7                                            /**< Shift value for EMU_GMC_CALIB_START */
#define _EMU_TESTCTRL_GMC_CALIB_START_MASK                  0x80UL                                       /**< Bit mask for EMU_GMC_CALIB_START */
#define _EMU_TESTCTRL_GMC_CALIB_START_DEFAULT               0x00000000UL                                 /**< Mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_GMC_CALIB_START_DEFAULT                (_EMU_TESTCTRL_GMC_CALIB_START_DEFAULT << 7) /**< Shifted mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_AVDD_BOD_DIS                           (0x1UL << 8)                                 /**< AVDD0/AVDD1 Bod Disable */
#define _EMU_TESTCTRL_AVDD_BOD_DIS_SHIFT                    8                                            /**< Shift value for EMU_AVDD_BOD_DIS */
#define _EMU_TESTCTRL_AVDD_BOD_DIS_MASK                     0x100UL                                      /**< Bit mask for EMU_AVDD_BOD_DIS */
#define _EMU_TESTCTRL_AVDD_BOD_DIS_DEFAULT                  0x00000000UL                                 /**< Mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_AVDD_BOD_DIS_DEFAULT                   (_EMU_TESTCTRL_AVDD_BOD_DIS_DEFAULT << 8)    /**< Shifted mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_SCAN_DRIVE_MODE                        (0x1UL << 9)                                 /**< Set to configure drive scan mode */
#define _EMU_TESTCTRL_SCAN_DRIVE_MODE_SHIFT                 9                                            /**< Shift value for EMU_SCAN_DRIVE_MODE */
#define _EMU_TESTCTRL_SCAN_DRIVE_MODE_MASK                  0x200UL                                      /**< Bit mask for EMU_SCAN_DRIVE_MODE */
#define _EMU_TESTCTRL_SCAN_DRIVE_MODE_DEFAULT               0x00000000UL                                 /**< Mode DEFAULT for EMU_TESTCTRL */
#define EMU_TESTCTRL_SCAN_DRIVE_MODE_DEFAULT                (_EMU_TESTCTRL_SCAN_DRIVE_MODE_DEFAULT << 9) /**< Shifted mode DEFAULT for EMU_TESTCTRL */

/* Bit fields for EMU ATESTCTRL */
#define _EMU_ATESTCTRL_RESETVALUE                           0x00000000UL                                  /**< Default value for EMU_ATESTCTRL */
#define _EMU_ATESTCTRL_MASK                                 0x07FFFF0FUL                                  /**< Mask for EMU_ATESTCTRL */
#define _EMU_ATESTCTRL_ATESTSEL_SHIFT                       0                                             /**< Shift value for EMU_ATESTSEL */
#define _EMU_ATESTCTRL_ATESTSEL_MASK                        0xFUL                                         /**< Bit mask for EMU_ATESTSEL */
#define _EMU_ATESTCTRL_ATESTSEL_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for EMU_ATESTCTRL */
#define EMU_ATESTCTRL_ATESTSEL_DEFAULT                      (_EMU_ATESTCTRL_ATESTSEL_DEFAULT << 0)        /**< Shifted mode DEFAULT for EMU_ATESTCTRL */
#define _EMU_ATESTCTRL_ATESTBUS_SHIFT                       8                                             /**< Shift value for EMU_ATESTBUS */
#define _EMU_ATESTCTRL_ATESTBUS_MASK                        0xFFFF00UL                                    /**< Bit mask for EMU_ATESTBUS */
#define _EMU_ATESTCTRL_ATESTBUS_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for EMU_ATESTCTRL */
#define EMU_ATESTCTRL_ATESTBUS_DEFAULT                      (_EMU_ATESTCTRL_ATESTBUS_DEFAULT << 8)        /**< Shifted mode DEFAULT for EMU_ATESTCTRL */
#define EMU_ATESTCTRL_DACATESTINEN                          (0x1UL << 24)                                 /**< DAC Test Input Enable */
#define _EMU_ATESTCTRL_DACATESTINEN_SHIFT                   24                                            /**< Shift value for EMU_DACATESTINEN */
#define _EMU_ATESTCTRL_DACATESTINEN_MASK                    0x1000000UL                                   /**< Bit mask for EMU_DACATESTINEN */
#define _EMU_ATESTCTRL_DACATESTINEN_DEFAULT                 0x00000000UL                                  /**< Mode DEFAULT for EMU_ATESTCTRL */
#define EMU_ATESTCTRL_DACATESTINEN_DEFAULT                  (_EMU_ATESTCTRL_DACATESTINEN_DEFAULT << 24)   /**< Shifted mode DEFAULT for EMU_ATESTCTRL */
#define EMU_ATESTCTRL_DAC_ATESTOUTEN                        (0x1UL << 25)                                 /**< DAC Test Output Enable */
#define _EMU_ATESTCTRL_DAC_ATESTOUTEN_SHIFT                 25                                            /**< Shift value for EMU_DAC_ATESTOUTEN */
#define _EMU_ATESTCTRL_DAC_ATESTOUTEN_MASK                  0x2000000UL                                   /**< Bit mask for EMU_DAC_ATESTOUTEN */
#define _EMU_ATESTCTRL_DAC_ATESTOUTEN_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for EMU_ATESTCTRL */
#define EMU_ATESTCTRL_DAC_ATESTOUTEN_DEFAULT                (_EMU_ATESTCTRL_DAC_ATESTOUTEN_DEFAULT << 25) /**< Shifted mode DEFAULT for EMU_ATESTCTRL */
#define EMU_ATESTCTRL_ANATESTINEN                           (0x1UL << 26)                                 /**< Analog Test Input Enable */
#define _EMU_ATESTCTRL_ANATESTINEN_SHIFT                    26                                            /**< Shift value for EMU_ANATESTINEN */
#define _EMU_ATESTCTRL_ANATESTINEN_MASK                     0x4000000UL                                   /**< Bit mask for EMU_ANATESTINEN */
#define _EMU_ATESTCTRL_ANATESTINEN_DEFAULT                  0x00000000UL                                  /**< Mode DEFAULT for EMU_ATESTCTRL */
#define EMU_ATESTCTRL_ANATESTINEN_DEFAULT                   (_EMU_ATESTCTRL_ANATESTINEN_DEFAULT << 26)    /**< Shifted mode DEFAULT for EMU_ATESTCTRL */

/* Bit fields for EMU ANACONF */
#define _EMU_ANACONF_RESETVALUE                             0x00011208UL                                    /**< Default value for EMU_ANACONF */
#define _EMU_ANACONF_MASK                                   0x0003FFFFUL                                    /**< Mask for EMU_ANACONF */
#define _EMU_ANACONF_BGR_OFFS_ADJ_COARSE_SHIFT              0                                               /**< Shift value for EMU_BGR_OFFS_ADJ_COARSE */
#define _EMU_ANACONF_BGR_OFFS_ADJ_COARSE_MASK               0xFUL                                           /**< Bit mask for EMU_BGR_OFFS_ADJ_COARSE */
#define _EMU_ANACONF_BGR_OFFS_ADJ_COARSE_DEFAULT            0x00000008UL                                    /**< Mode DEFAULT for EMU_ANACONF */
#define EMU_ANACONF_BGR_OFFS_ADJ_COARSE_DEFAULT             (_EMU_ANACONF_BGR_OFFS_ADJ_COARSE_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_ANACONF */
#define _EMU_ANACONF_BGR_OFFS_ADJ_FINE_SHIFT                4                                               /**< Shift value for EMU_BGR_OFFS_ADJ_FINE */
#define _EMU_ANACONF_BGR_OFFS_ADJ_FINE_MASK                 0xF0UL                                          /**< Bit mask for EMU_BGR_OFFS_ADJ_FINE */
#define _EMU_ANACONF_BGR_OFFS_ADJ_FINE_DEFAULT              0x00000000UL                                    /**< Mode DEFAULT for EMU_ANACONF */
#define EMU_ANACONF_BGR_OFFS_ADJ_FINE_DEFAULT               (_EMU_ANACONF_BGR_OFFS_ADJ_FINE_DEFAULT << 4)   /**< Shifted mode DEFAULT for EMU_ANACONF */
#define _EMU_ANACONF_BGR_OPA_CURRENT_SHIFT                  8                                               /**< Shift value for EMU_BGR_OPA_CURRENT */
#define _EMU_ANACONF_BGR_OPA_CURRENT_MASK                   0x300UL                                         /**< Bit mask for EMU_BGR_OPA_CURRENT */
#define _EMU_ANACONF_BGR_OPA_CURRENT_DEFAULT                0x00000002UL                                    /**< Mode DEFAULT for EMU_ANACONF */
#define EMU_ANACONF_BGR_OPA_CURRENT_DEFAULT                 (_EMU_ANACONF_BGR_OPA_CURRENT_DEFAULT << 8)     /**< Shifted mode DEFAULT for EMU_ANACONF */
#define _EMU_ANACONF_BGR_CAL_INT_SHIFT                      10                                              /**< Shift value for EMU_BGR_CAL_INT */
#define _EMU_ANACONF_BGR_CAL_INT_MASK                       0xC00UL                                         /**< Bit mask for EMU_BGR_CAL_INT */
#define _EMU_ANACONF_BGR_CAL_INT_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for EMU_ANACONF */
#define EMU_ANACONF_BGR_CAL_INT_DEFAULT                     (_EMU_ANACONF_BGR_CAL_INT_DEFAULT << 10)        /**< Shifted mode DEFAULT for EMU_ANACONF */
#define _EMU_ANACONF_DUTY_CLK_DIV_FACT_SHIFT                12                                              /**< Shift value for EMU_DUTY_CLK_DIV_FACT */
#define _EMU_ANACONF_DUTY_CLK_DIV_FACT_MASK                 0x7000UL                                        /**< Bit mask for EMU_DUTY_CLK_DIV_FACT */
#define _EMU_ANACONF_DUTY_CLK_DIV_FACT_DEFAULT              0x00000001UL                                    /**< Mode DEFAULT for EMU_ANACONF */
#define EMU_ANACONF_DUTY_CLK_DIV_FACT_DEFAULT               (_EMU_ANACONF_DUTY_CLK_DIV_FACT_DEFAULT << 12)  /**< Shifted mode DEFAULT for EMU_ANACONF */
#define _EMU_ANACONF_DUTY_PROC_COMP_SHIFT                   15                                              /**< Shift value for EMU_DUTY_PROC_COMP */
#define _EMU_ANACONF_DUTY_PROC_COMP_MASK                    0x38000UL                                       /**< Bit mask for EMU_DUTY_PROC_COMP */
#define _EMU_ANACONF_DUTY_PROC_COMP_DEFAULT                 0x00000002UL                                    /**< Mode DEFAULT for EMU_ANACONF */
#define EMU_ANACONF_DUTY_PROC_COMP_DEFAULT                  (_EMU_ANACONF_DUTY_PROC_COMP_DEFAULT << 15)     /**< Shifted mode DEFAULT for EMU_ANACONF */

/* Bit fields for EMU DREGCONF */
#define _EMU_DREGCONF_RESETVALUE                            0x368D2A00UL                                             /**< Default value for EMU_DREGCONF */
#define _EMU_DREGCONF_MASK                                  0xFFFFFFFFUL                                             /**< Mask for EMU_DREGCONF */
#define _EMU_DREGCONF_DLY_HD_OK2SW_ON_SHIFT                 0                                                        /**< Shift value for EMU_DLY_HD_OK2SW_ON */
#define _EMU_DREGCONF_DLY_HD_OK2SW_ON_MASK                  0x1FUL                                                   /**< Bit mask for EMU_DLY_HD_OK2SW_ON */
#define _EMU_DREGCONF_DLY_HD_OK2SW_ON_DEFAULT               0x00000000UL                                             /**< Mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_DLY_HD_OK2SW_ON_DEFAULT                (_EMU_DREGCONF_DLY_HD_OK2SW_ON_DEFAULT << 0)             /**< Shifted mode DEFAULT for EMU_DREGCONF */
#define _EMU_DREGCONF_DLY_SW_OFF2HD_OFF_SHIFT               5                                                        /**< Shift value for EMU_DLY_SW_OFF2HD_OFF */
#define _EMU_DREGCONF_DLY_SW_OFF2HD_OFF_MASK                0x60UL                                                   /**< Bit mask for EMU_DLY_SW_OFF2HD_OFF */
#define _EMU_DREGCONF_DLY_SW_OFF2HD_OFF_DEFAULT             0x00000000UL                                             /**< Mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_DLY_SW_OFF2HD_OFF_DEFAULT              (_EMU_DREGCONF_DLY_SW_OFF2HD_OFF_DEFAULT << 5)           /**< Shifted mode DEFAULT for EMU_DREGCONF */
#define _EMU_DREGCONF_DLY_HFOSC_ON2HFOSC_STABLE_SHIFT       7                                                        /**< Shift value for EMU_DLY_HFOSC_ON2HFOSC_STABLE */
#define _EMU_DREGCONF_DLY_HFOSC_ON2HFOSC_STABLE_MASK        0x1F80UL                                                 /**< Bit mask for EMU_DLY_HFOSC_ON2HFOSC_STABLE */
#define _EMU_DREGCONF_DLY_HFOSC_ON2HFOSC_STABLE_DEFAULT     0x00000014UL                                             /**< Mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_DLY_HFOSC_ON2HFOSC_STABLE_DEFAULT      (_EMU_DREGCONF_DLY_HFOSC_ON2HFOSC_STABLE_DEFAULT << 7)   /**< Shifted mode DEFAULT for EMU_DREGCONF */
#define _EMU_DREGCONF_DREG_HD_REG_CURR_SHIFT                13                                                       /**< Shift value for EMU_DREG_HD_REG_CURR */
#define _EMU_DREGCONF_DREG_HD_REG_CURR_MASK                 0x6000UL                                                 /**< Bit mask for EMU_DREG_HD_REG_CURR */
#define _EMU_DREGCONF_DREG_HD_REG_CURR_DEFAULT              0x00000001UL                                             /**< Mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_DREG_HD_REG_CURR_DEFAULT               (_EMU_DREGCONF_DREG_HD_REG_CURR_DEFAULT << 13)           /**< Shifted mode DEFAULT for EMU_DREGCONF */
#define _EMU_DREGCONF_DREG_LD_REG_CURR_SHIFT                15                                                       /**< Shift value for EMU_DREG_LD_REG_CURR */
#define _EMU_DREGCONF_DREG_LD_REG_CURR_MASK                 0x38000UL                                                /**< Bit mask for EMU_DREG_LD_REG_CURR */
#define _EMU_DREGCONF_DREG_LD_REG_CURR_DEFAULT              0x00000002UL                                             /**< Mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_DREG_LD_REG_CURR_DEFAULT               (_EMU_DREGCONF_DREG_LD_REG_CURR_DEFAULT << 15)           /**< Shifted mode DEFAULT for EMU_DREGCONF */
#define _EMU_DREGCONF_DREG_ADAPT_OFF_LEVEL_SHIFT            18                                                       /**< Shift value for EMU_DREG_ADAPT_OFF_LEVEL */
#define _EMU_DREGCONF_DREG_ADAPT_OFF_LEVEL_MASK             0x1C0000UL                                               /**< Bit mask for EMU_DREG_ADAPT_OFF_LEVEL */
#define _EMU_DREGCONF_DREG_ADAPT_OFF_LEVEL_DEFAULT          0x00000003UL                                             /**< Mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_DREG_ADAPT_OFF_LEVEL_DEFAULT           (_EMU_DREGCONF_DREG_ADAPT_OFF_LEVEL_DEFAULT << 18)       /**< Shifted mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_DREG_ADAPT_OFF_EN                      (0x1UL << 21)                                            /**< DREG high drain adaptive turn off enable */
#define _EMU_DREGCONF_DREG_ADAPT_OFF_EN_SHIFT               21                                                       /**< Shift value for EMU_DREG_ADAPT_OFF_EN */
#define _EMU_DREGCONF_DREG_ADAPT_OFF_EN_MASK                0x200000UL                                               /**< Bit mask for EMU_DREG_ADAPT_OFF_EN */
#define _EMU_DREGCONF_DREG_ADAPT_OFF_EN_DEFAULT             0x00000000UL                                             /**< Mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_DREG_ADAPT_OFF_EN_DEFAULT              (_EMU_DREGCONF_DREG_ADAPT_OFF_EN_DEFAULT << 21)          /**< Shifted mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_DREG_HD_PD_EN                          (0x1UL << 22)                                            /**< DREG high drain regulator pull down enable */
#define _EMU_DREGCONF_DREG_HD_PD_EN_SHIFT                   22                                                       /**< Shift value for EMU_DREG_HD_PD_EN */
#define _EMU_DREGCONF_DREG_HD_PD_EN_MASK                    0x400000UL                                               /**< Bit mask for EMU_DREG_HD_PD_EN */
#define _EMU_DREGCONF_DREG_HD_PD_EN_DEFAULT                 0x00000000UL                                             /**< Mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_DREG_HD_PD_EN_DEFAULT                  (_EMU_DREGCONF_DREG_HD_PD_EN_DEFAULT << 22)              /**< Shifted mode DEFAULT for EMU_DREGCONF */
#define _EMU_DREGCONF_DREG_VER_VOLT_SEL_SHIFT               23                                                       /**< Shift value for EMU_DREG_VER_VOLT_SEL */
#define _EMU_DREGCONF_DREG_VER_VOLT_SEL_MASK                0x1800000UL                                              /**< Bit mask for EMU_DREG_VER_VOLT_SEL */
#define _EMU_DREGCONF_DREG_VER_VOLT_SEL_DEFAULT             0x00000001UL                                             /**< Mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_DREG_VER_VOLT_SEL_DEFAULT              (_EMU_DREGCONF_DREG_VER_VOLT_SEL_DEFAULT << 23)          /**< Shifted mode DEFAULT for EMU_DREGCONF */
#define _EMU_DREGCONF_PORBOD_DREG_LD_VOLTAGE_SHIFT          25                                                       /**< Shift value for EMU_PORBOD_DREG_LD_VOLTAGE */
#define _EMU_DREGCONF_PORBOD_DREG_LD_VOLTAGE_MASK           0xE000000UL                                              /**< Bit mask for EMU_PORBOD_DREG_LD_VOLTAGE */
#define _EMU_DREGCONF_PORBOD_DREG_LD_VOLTAGE_DEFAULT        0x00000003UL                                             /**< Mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_PORBOD_DREG_LD_VOLTAGE_DEFAULT         (_EMU_DREGCONF_PORBOD_DREG_LD_VOLTAGE_DEFAULT << 25)     /**< Shifted mode DEFAULT for EMU_DREGCONF */
#define _EMU_DREGCONF_PORBOD_DREG_LD_VOLTAGE_BGR_SHIFT      28                                                       /**< Shift value for EMU_PORBOD_DREG_LD_VOLTAGE_BGR */
#define _EMU_DREGCONF_PORBOD_DREG_LD_VOLTAGE_BGR_MASK       0x70000000UL                                             /**< Bit mask for EMU_PORBOD_DREG_LD_VOLTAGE_BGR */
#define _EMU_DREGCONF_PORBOD_DREG_LD_VOLTAGE_BGR_DEFAULT    0x00000003UL                                             /**< Mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_PORBOD_DREG_LD_VOLTAGE_BGR_DEFAULT     (_EMU_DREGCONF_PORBOD_DREG_LD_VOLTAGE_BGR_DEFAULT << 28) /**< Shifted mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_DREG_LD_REG_CURR_LSB                   (0x1UL << 31)                                            /**< PORBOD DREG low drain voltage lsb */
#define _EMU_DREGCONF_DREG_LD_REG_CURR_LSB_SHIFT            31                                                       /**< Shift value for EMU_DREG_LD_REG_CURR_LSB */
#define _EMU_DREGCONF_DREG_LD_REG_CURR_LSB_MASK             0x80000000UL                                             /**< Bit mask for EMU_DREG_LD_REG_CURR_LSB */
#define _EMU_DREGCONF_DREG_LD_REG_CURR_LSB_DEFAULT          0x00000000UL                                             /**< Mode DEFAULT for EMU_DREGCONF */
#define EMU_DREGCONF_DREG_LD_REG_CURR_LSB_DEFAULT           (_EMU_DREGCONF_DREG_LD_REG_CURR_LSB_DEFAULT << 31)       /**< Shifted mode DEFAULT for EMU_DREGCONF */

