ARMmbed/DAPLink/source/common/cmsis-core/siliconlabs/efm32lg/efm32lgfull.h
/* Bit fields for EMU IFC */
#define _EMU_IFC_RESETVALUE                                 0x00000000UL                  /**< Default value for EMU_IFC */
#define _EMU_IFC_MASK                                       0x00000001UL                  /**< Mask for EMU_IFC */
#define EMU_IFC_BURDY                                       (0x1UL << 0)                  /**< Clear Backup functionality ready Interrupt Flag */
#define _EMU_IFC_BURDY_SHIFT                                0                             /**< Shift value for EMU_BURDY */
#define _EMU_IFC_BURDY_MASK                                 0x1UL                         /**< Bit mask for EMU_BURDY */
#define _EMU_IFC_BURDY_DEFAULT                              0x00000000UL                  /**< Mode DEFAULT for EMU_IFC */
#define EMU_IFC_BURDY_DEFAULT                               (_EMU_IFC_BURDY_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_IFC */

/* Bit fields for EMU IEN */
#define _EMU_IEN_RESETVALUE                                 0x00000000UL                  /**< Default value for EMU_IEN */
#define _EMU_IEN_MASK                                       0x00000001UL                  /**< Mask for EMU_IEN */
#define EMU_IEN_BURDY                                       (0x1UL << 0)                  /**< Backup functionality ready Interrupt Enable */
#define _EMU_IEN_BURDY_SHIFT                                0                             /**< Shift value for EMU_BURDY */
#define _EMU_IEN_BURDY_MASK                                 0x1UL                         /**< Bit mask for EMU_BURDY */
#define _EMU_IEN_BURDY_DEFAULT                              0x00000000UL                  /**< Mode DEFAULT for EMU_IEN */
#define EMU_IEN_BURDY_DEFAULT                               (_EMU_IEN_BURDY_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_IEN */

/* Bit fields for EMU BUBODBUVINCAL */
#define _EMU_BUBODBUVINCAL_RESETVALUE                       0x0000000BUL                                   /**< Default value for EMU_BUBODBUVINCAL */
#define _EMU_BUBODBUVINCAL_MASK                             0x0000007FUL                                   /**< Mask for EMU_BUBODBUVINCAL */
#define _EMU_BUBODBUVINCAL_THRES_SHIFT                      0                                              /**< Shift value for EMU_THRES */
#define _EMU_BUBODBUVINCAL_THRES_MASK                       0x7UL                                          /**< Bit mask for EMU_THRES */
#define _EMU_BUBODBUVINCAL_THRES_DEFAULT                    0x00000003UL                                   /**< Mode DEFAULT for EMU_BUBODBUVINCAL */
#define EMU_BUBODBUVINCAL_THRES_DEFAULT                     (_EMU_BUBODBUVINCAL_THRES_DEFAULT << 0)        /**< Shifted mode DEFAULT for EMU_BUBODBUVINCAL */
#define _EMU_BUBODBUVINCAL_RANGE_SHIFT                      3                                              /**< Shift value for EMU_RANGE */
#define _EMU_BUBODBUVINCAL_RANGE_MASK                       0x18UL                                         /**< Bit mask for EMU_RANGE */
#define _EMU_BUBODBUVINCAL_RANGE_DEFAULT                    0x00000001UL                                   /**< Mode DEFAULT for EMU_BUBODBUVINCAL */
#define EMU_BUBODBUVINCAL_RANGE_DEFAULT                     (_EMU_BUBODBUVINCAL_RANGE_DEFAULT << 3)        /**< Shifted mode DEFAULT for EMU_BUBODBUVINCAL */
#define _EMU_BUBODBUVINCAL_BUBODOTABIAS_SHIFT               5                                              /**< Shift value for EMU_BUBODOTABIAS */
#define _EMU_BUBODBUVINCAL_BUBODOTABIAS_MASK                0x60UL                                         /**< Bit mask for EMU_BUBODOTABIAS */
#define _EMU_BUBODBUVINCAL_BUBODOTABIAS_DEFAULT             0x00000000UL                                   /**< Mode DEFAULT for EMU_BUBODBUVINCAL */
#define EMU_BUBODBUVINCAL_BUBODOTABIAS_DEFAULT              (_EMU_BUBODBUVINCAL_BUBODOTABIAS_DEFAULT << 5) /**< Shifted mode DEFAULT for EMU_BUBODBUVINCAL */

/* Bit fields for EMU BUBODUNREGCAL */
#define _EMU_BUBODUNREGCAL_RESETVALUE                       0x0000000BUL                            /**< Default value for EMU_BUBODUNREGCAL */
#define _EMU_BUBODUNREGCAL_MASK                             0x0000001FUL                            /**< Mask for EMU_BUBODUNREGCAL */
#define _EMU_BUBODUNREGCAL_THRES_SHIFT                      0                                       /**< Shift value for EMU_THRES */
#define _EMU_BUBODUNREGCAL_THRES_MASK                       0x7UL                                   /**< Bit mask for EMU_THRES */
#define _EMU_BUBODUNREGCAL_THRES_DEFAULT                    0x00000003UL                            /**< Mode DEFAULT for EMU_BUBODUNREGCAL */
#define EMU_BUBODUNREGCAL_THRES_DEFAULT                     (_EMU_BUBODUNREGCAL_THRES_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_BUBODUNREGCAL */
#define _EMU_BUBODUNREGCAL_RANGE_SHIFT                      3                                       /**< Shift value for EMU_RANGE */
#define _EMU_BUBODUNREGCAL_RANGE_MASK                       0x18UL                                  /**< Bit mask for EMU_RANGE */
#define _EMU_BUBODUNREGCAL_RANGE_DEFAULT                    0x00000001UL                            /**< Mode DEFAULT for EMU_BUBODUNREGCAL */
#define EMU_BUBODUNREGCAL_RANGE_DEFAULT                     (_EMU_BUBODUNREGCAL_RANGE_DEFAULT << 3) /**< Shifted mode DEFAULT for EMU_BUBODUNREGCAL */

/* Bit fields for EMU BUBODDECOUPLECAL */
#define _EMU_BUBODDECOUPLECAL_RESETVALUE                    0x00000000UL                                   /**< Default value for EMU_BUBODDECOUPLECAL */
#define _EMU_BUBODDECOUPLECAL_MASK                          0x0000005FUL                                   /**< Mask for EMU_BUBODDECOUPLECAL */
#define _EMU_BUBODDECOUPLECAL_THRES_SHIFT                   0                                              /**< Shift value for EMU_THRES */
#define _EMU_BUBODDECOUPLECAL_THRES_MASK                    0x7UL                                          /**< Bit mask for EMU_THRES */
#define _EMU_BUBODDECOUPLECAL_THRES_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for EMU_BUBODDECOUPLECAL */
#define EMU_BUBODDECOUPLECAL_THRES_DEFAULT                  (_EMU_BUBODDECOUPLECAL_THRES_DEFAULT << 0)     /**< Shifted mode DEFAULT for EMU_BUBODDECOUPLECAL */
#define _EMU_BUBODDECOUPLECAL_RANGE_SHIFT                   3                                              /**< Shift value for EMU_RANGE */
#define _EMU_BUBODDECOUPLECAL_RANGE_MASK                    0x18UL                                         /**< Bit mask for EMU_RANGE */
#define _EMU_BUBODDECOUPLECAL_RANGE_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for EMU_BUBODDECOUPLECAL */
#define EMU_BUBODDECOUPLECAL_RANGE_DEFAULT                  (_EMU_BUBODDECOUPLECAL_RANGE_DEFAULT << 3)     /**< Shifted mode DEFAULT for EMU_BUBODDECOUPLECAL */
#define EMU_BUBODDECOUPLECAL_EM4TESTEN                      (0x1UL << 6)                                   /**< EM4 test enable */
#define _EMU_BUBODDECOUPLECAL_EM4TESTEN_SHIFT               6                                              /**< Shift value for EMU_EM4TESTEN */
#define _EMU_BUBODDECOUPLECAL_EM4TESTEN_MASK                0x40UL                                         /**< Bit mask for EMU_EM4TESTEN */
#define _EMU_BUBODDECOUPLECAL_EM4TESTEN_DEFAULT             0x00000000UL                                   /**< Mode DEFAULT for EMU_BUBODDECOUPLECAL */
#define EMU_BUBODDECOUPLECAL_EM4TESTEN_DEFAULT              (_EMU_BUBODDECOUPLECAL_EM4TESTEN_DEFAULT << 6) /**< Shifted mode DEFAULT for EMU_BUBODDECOUPLECAL */

/* Bit fields for EMU EM4CALIB */
#define _EMU_EM4CALIB_RESETVALUE                            0x0600100FUL                                        /**< Default value for EMU_EM4CALIB */
#define _EMU_EM4CALIB_MASK                                  0x0E00700FUL                                        /**< Mask for EMU_EM4CALIB */
#define _EMU_EM4CALIB_DREGLDREGCURRBU_SHIFT                 0                                                   /**< Shift value for EMU_DREGLDREGCURRBU */
#define _EMU_EM4CALIB_DREGLDREGCURRBU_MASK                  0xFUL                                               /**< Bit mask for EMU_DREGLDREGCURRBU */
#define _EMU_EM4CALIB_DREGLDREGCURRBU_DEFAULT               0x0000000FUL                                        /**< Mode DEFAULT for EMU_EM4CALIB */
#define EMU_EM4CALIB_DREGLDREGCURRBU_DEFAULT                (_EMU_EM4CALIB_DREGLDREGCURRBU_DEFAULT << 0)        /**< Shifted mode DEFAULT for EMU_EM4CALIB */
#define _EMU_EM4CALIB_DUTYCLKDIVFACTBU_SHIFT                12                                                  /**< Shift value for EMU_DUTYCLKDIVFACTBU */
#define _EMU_EM4CALIB_DUTYCLKDIVFACTBU_MASK                 0x7000UL                                            /**< Bit mask for EMU_DUTYCLKDIVFACTBU */
#define _EMU_EM4CALIB_DUTYCLKDIVFACTBU_DEFAULT              0x00000001UL                                        /**< Mode DEFAULT for EMU_EM4CALIB */
#define EMU_EM4CALIB_DUTYCLKDIVFACTBU_DEFAULT               (_EMU_EM4CALIB_DUTYCLKDIVFACTBU_DEFAULT << 12)      /**< Shifted mode DEFAULT for EMU_EM4CALIB */
#define _EMU_EM4CALIB_PORBODDREGLDVOLTAGEBU_SHIFT           25                                                  /**< Shift value for EMU_PORBODDREGLDVOLTAGEBU */
#define _EMU_EM4CALIB_PORBODDREGLDVOLTAGEBU_MASK            0xE000000UL                                         /**< Bit mask for EMU_PORBODDREGLDVOLTAGEBU */
#define _EMU_EM4CALIB_PORBODDREGLDVOLTAGEBU_DEFAULT         0x00000003UL                                        /**< Mode DEFAULT for EMU_EM4CALIB */
#define EMU_EM4CALIB_PORBODDREGLDVOLTAGEBU_DEFAULT          (_EMU_EM4CALIB_PORBODDREGLDVOLTAGEBU_DEFAULT << 25) /**< Shifted mode DEFAULT for EMU_EM4CALIB */

/** @} End of group EFM32LGFULL_EMU */


/**************************************************************************//**
 * @defgroup EFM32LGFULL_RMU_BitFields  EFM32LGFULL_RMU Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for RMU CTRL */
#define _RMU_CTRL_RESETVALUE                                               0x00000002UL                        /**< Default value for RMU_CTRL */
#define _RMU_CTRL_MASK                                                     0x00000003UL                        /**< Mask for RMU_CTRL */
#define RMU_CTRL_LOCKUPRDIS                                                (0x1UL << 0)                        /**< Lockup Reset Disable */
#define _RMU_CTRL_LOCKUPRDIS_SHIFT                                         0                                   /**< Shift value for RMU_LOCKUPRDIS */
#define _RMU_CTRL_LOCKUPRDIS_MASK                                          0x1UL                               /**< Bit mask for RMU_LOCKUPRDIS */
#define _RMU_CTRL_LOCKUPRDIS_DEFAULT                                       0x00000000UL                        /**< Mode DEFAULT for RMU_CTRL */
#define RMU_CTRL_LOCKUPRDIS_DEFAULT                                        (_RMU_CTRL_LOCKUPRDIS_DEFAULT << 0) /**< Shifted mode DEFAULT for RMU_CTRL */
#define RMU_CTRL_BURSTEN                                                   (0x1UL << 1)                        /**< Backup domain reset enable */
#define _RMU_CTRL_BURSTEN_SHIFT                                            1                                   /**< Shift value for RMU_BURSTEN */
#define _RMU_CTRL_BURSTEN_MASK                                             0x2UL                               /**< Bit mask for RMU_BURSTEN */
#define _RMU_CTRL_BURSTEN_DEFAULT                                          0x00000001UL                        /**< Mode DEFAULT for RMU_CTRL */
#define RMU_CTRL_BURSTEN_DEFAULT                                           (_RMU_CTRL_BURSTEN_DEFAULT << 1)    /**< Shifted mode DEFAULT for RMU_CTRL */

