ARMmbed/DAPLink/source/common/cmsis-core/siliconlabs/efm32lg/efm32lgfull.h
/* Bit fields for CMU HFPERCLKENMASK0 */
#define _CMU_HFPERCLKENMASK0_RESETVALUE             0x001FFFFFUL                               /**< Default value for CMU_HFPERCLKENMASK0 */
#define _CMU_HFPERCLKENMASK0_MASK                   0x00035FDFUL                               /**< Mask for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_USART0                  (0x1UL << 0)                               /**< Universal Synchronous/Asynchronous Receiver/Transmitter 0 Lock */
#define _CMU_HFPERCLKENMASK0_USART0_SHIFT           0                                          /**< Shift value for CMU_USART0 */
#define _CMU_HFPERCLKENMASK0_USART0_MASK            0x1UL                                      /**< Bit mask for CMU_USART0 */
#define _CMU_HFPERCLKENMASK0_USART0_DEFAULT         0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_USART0_DEFAULT          (_CMU_HFPERCLKENMASK0_USART0_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_USART1                  (0x1UL << 1)                               /**< Universal Synchronous/Asynchronous Receiver/Transmitter 1 Lock */
#define _CMU_HFPERCLKENMASK0_USART1_SHIFT           1                                          /**< Shift value for CMU_USART1 */
#define _CMU_HFPERCLKENMASK0_USART1_MASK            0x2UL                                      /**< Bit mask for CMU_USART1 */
#define _CMU_HFPERCLKENMASK0_USART1_DEFAULT         0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_USART1_DEFAULT          (_CMU_HFPERCLKENMASK0_USART1_DEFAULT << 1) /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_USART2                  (0x1UL << 2)                               /**< Universal Synchronous/Asynchronous Receiver/Transmitter 2 Lock */
#define _CMU_HFPERCLKENMASK0_USART2_SHIFT           2                                          /**< Shift value for CMU_USART2 */
#define _CMU_HFPERCLKENMASK0_USART2_MASK            0x4UL                                      /**< Bit mask for CMU_USART2 */
#define _CMU_HFPERCLKENMASK0_USART2_DEFAULT         0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_USART2_DEFAULT          (_CMU_HFPERCLKENMASK0_USART2_DEFAULT << 2) /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_UART0                   (0x1UL << 3)                               /**< Universal Asynchronous Receiver/Transmitter 0 Lock */
#define _CMU_HFPERCLKENMASK0_UART0_SHIFT            3                                          /**< Shift value for CMU_UART0 */
#define _CMU_HFPERCLKENMASK0_UART0_MASK             0x8UL                                      /**< Bit mask for CMU_UART0 */
#define _CMU_HFPERCLKENMASK0_UART0_DEFAULT          0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_UART0_DEFAULT           (_CMU_HFPERCLKENMASK0_UART0_DEFAULT << 3)  /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_UART1                   (0x1UL << 4)                               /**< Universal Asynchronous Receiver/Transmitter 1 Lock */
#define _CMU_HFPERCLKENMASK0_UART1_SHIFT            4                                          /**< Shift value for CMU_UART1 */
#define _CMU_HFPERCLKENMASK0_UART1_MASK             0x10UL                                     /**< Bit mask for CMU_UART1 */
#define _CMU_HFPERCLKENMASK0_UART1_DEFAULT          0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_UART1_DEFAULT           (_CMU_HFPERCLKENMASK0_UART1_DEFAULT << 4)  /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_TIMER1                  (0x1UL << 6)                               /**< Timer 1 Lock */
#define _CMU_HFPERCLKENMASK0_TIMER1_SHIFT           6                                          /**< Shift value for CMU_TIMER1 */
#define _CMU_HFPERCLKENMASK0_TIMER1_MASK            0x40UL                                     /**< Bit mask for CMU_TIMER1 */
#define _CMU_HFPERCLKENMASK0_TIMER1_DEFAULT         0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_TIMER1_DEFAULT          (_CMU_HFPERCLKENMASK0_TIMER1_DEFAULT << 6) /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_TIMER2                  (0x1UL << 7)                               /**< Timer 2 Lock */
#define _CMU_HFPERCLKENMASK0_TIMER2_SHIFT           7                                          /**< Shift value for CMU_TIMER2 */
#define _CMU_HFPERCLKENMASK0_TIMER2_MASK            0x80UL                                     /**< Bit mask for CMU_TIMER2 */
#define _CMU_HFPERCLKENMASK0_TIMER2_DEFAULT         0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_TIMER2_DEFAULT          (_CMU_HFPERCLKENMASK0_TIMER2_DEFAULT << 7) /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_TIMER3                  (0x1UL << 8)                               /**< Timer 3 Lock */
#define _CMU_HFPERCLKENMASK0_TIMER3_SHIFT           8                                          /**< Shift value for CMU_TIMER3 */
#define _CMU_HFPERCLKENMASK0_TIMER3_MASK            0x100UL                                    /**< Bit mask for CMU_TIMER3 */
#define _CMU_HFPERCLKENMASK0_TIMER3_DEFAULT         0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_TIMER3_DEFAULT          (_CMU_HFPERCLKENMASK0_TIMER3_DEFAULT << 8) /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_ACMP0                   (0x1UL << 9)                               /**< Analog Comparator 0 Lock */
#define _CMU_HFPERCLKENMASK0_ACMP0_SHIFT            9                                          /**< Shift value for CMU_ACMP0 */
#define _CMU_HFPERCLKENMASK0_ACMP0_MASK             0x200UL                                    /**< Bit mask for CMU_ACMP0 */
#define _CMU_HFPERCLKENMASK0_ACMP0_DEFAULT          0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_ACMP0_DEFAULT           (_CMU_HFPERCLKENMASK0_ACMP0_DEFAULT << 9)  /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_ACMP1                   (0x1UL << 10)                              /**< Analog Comparator 1 Lock */
#define _CMU_HFPERCLKENMASK0_ACMP1_SHIFT            10                                         /**< Shift value for CMU_ACMP1 */
#define _CMU_HFPERCLKENMASK0_ACMP1_MASK             0x400UL                                    /**< Bit mask for CMU_ACMP1 */
#define _CMU_HFPERCLKENMASK0_ACMP1_DEFAULT          0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_ACMP1_DEFAULT           (_CMU_HFPERCLKENMASK0_ACMP1_DEFAULT << 10) /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_I2C0                    (0x1UL << 11)                              /**< I2C 0 Lock */
#define _CMU_HFPERCLKENMASK0_I2C0_SHIFT             11                                         /**< Shift value for CMU_I2C0 */
#define _CMU_HFPERCLKENMASK0_I2C0_MASK              0x800UL                                    /**< Bit mask for CMU_I2C0 */
#define _CMU_HFPERCLKENMASK0_I2C0_DEFAULT           0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_I2C0_DEFAULT            (_CMU_HFPERCLKENMASK0_I2C0_DEFAULT << 11)  /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_I2C1                    (0x1UL << 12)                              /**< I2C 1 Lock */
#define _CMU_HFPERCLKENMASK0_I2C1_SHIFT             12                                         /**< Shift value for CMU_I2C1 */
#define _CMU_HFPERCLKENMASK0_I2C1_MASK              0x1000UL                                   /**< Bit mask for CMU_I2C1 */
#define _CMU_HFPERCLKENMASK0_I2C1_DEFAULT           0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_I2C1_DEFAULT            (_CMU_HFPERCLKENMASK0_I2C1_DEFAULT << 12)  /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_VCMP                    (0x1UL << 14)                              /**< Voltage Comparator Lock */
#define _CMU_HFPERCLKENMASK0_VCMP_SHIFT             14                                         /**< Shift value for CMU_VCMP */
#define _CMU_HFPERCLKENMASK0_VCMP_MASK              0x4000UL                                   /**< Bit mask for CMU_VCMP */
#define _CMU_HFPERCLKENMASK0_VCMP_DEFAULT           0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_VCMP_DEFAULT            (_CMU_HFPERCLKENMASK0_VCMP_DEFAULT << 14)  /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_ADC0                    (0x1UL << 16)                              /**< Analog to Digital Converter 0 Lock */
#define _CMU_HFPERCLKENMASK0_ADC0_SHIFT             16                                         /**< Shift value for CMU_ADC0 */
#define _CMU_HFPERCLKENMASK0_ADC0_MASK              0x10000UL                                  /**< Bit mask for CMU_ADC0 */
#define _CMU_HFPERCLKENMASK0_ADC0_DEFAULT           0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_ADC0_DEFAULT            (_CMU_HFPERCLKENMASK0_ADC0_DEFAULT << 16)  /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_DAC0                    (0x1UL << 17)                              /**< Digital to Analog Converter 0 Lock */
#define _CMU_HFPERCLKENMASK0_DAC0_SHIFT             17                                         /**< Shift value for CMU_DAC0 */
#define _CMU_HFPERCLKENMASK0_DAC0_MASK              0x20000UL                                  /**< Bit mask for CMU_DAC0 */
#define _CMU_HFPERCLKENMASK0_DAC0_DEFAULT           0x00000001UL                               /**< Mode DEFAULT for CMU_HFPERCLKENMASK0 */
#define CMU_HFPERCLKENMASK0_DAC0_DEFAULT            (_CMU_HFPERCLKENMASK0_DAC0_DEFAULT << 17)  /**< Shifted mode DEFAULT for CMU_HFPERCLKENMASK0 */

/* Bit fields for CMU LFACLKENMASK0 */
#define _CMU_LFACLKENMASK0_RESETVALUE               0x0000000FUL                              /**< Default value for CMU_LFACLKENMASK0 */
#define _CMU_LFACLKENMASK0_MASK                     0x00000009UL                              /**< Mask for CMU_LFACLKENMASK0 */
#define CMU_LFACLKENMASK0_LESENSE                   (0x1UL << 0)                              /**< Low Energy Sensor Interface Lock */
#define _CMU_LFACLKENMASK0_LESENSE_SHIFT            0                                         /**< Shift value for CMU_LESENSE */
#define _CMU_LFACLKENMASK0_LESENSE_MASK             0x1UL                                     /**< Bit mask for CMU_LESENSE */
#define _CMU_LFACLKENMASK0_LESENSE_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for CMU_LFACLKENMASK0 */
#define CMU_LFACLKENMASK0_LESENSE_DEFAULT           (_CMU_LFACLKENMASK0_LESENSE_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_LFACLKENMASK0 */
#define CMU_LFACLKENMASK0_LCD                       (0x1UL << 3)                              /**< Liquid Crystal Display Controller Lock */
#define _CMU_LFACLKENMASK0_LCD_SHIFT                3                                         /**< Shift value for CMU_LCD */
#define _CMU_LFACLKENMASK0_LCD_MASK                 0x8UL                                     /**< Bit mask for CMU_LCD */
#define _CMU_LFACLKENMASK0_LCD_DEFAULT              0x00000001UL                              /**< Mode DEFAULT for CMU_LFACLKENMASK0 */
#define CMU_LFACLKENMASK0_LCD_DEFAULT               (_CMU_LFACLKENMASK0_LCD_DEFAULT << 3)     /**< Shifted mode DEFAULT for CMU_LFACLKENMASK0 */

/* Bit fields for CMU LFBCLKENMASK0 */
#define _CMU_LFBCLKENMASK0_RESETVALUE               0x00000003UL                              /**< Default value for CMU_LFBCLKENMASK0 */
#define _CMU_LFBCLKENMASK0_MASK                     0x00000003UL                              /**< Mask for CMU_LFBCLKENMASK0 */
#define CMU_LFBCLKENMASK0_LEUART0                   (0x1UL << 0)                              /**< Low Energy UART 0 Lock */
#define _CMU_LFBCLKENMASK0_LEUART0_SHIFT            0                                         /**< Shift value for CMU_LEUART0 */
#define _CMU_LFBCLKENMASK0_LEUART0_MASK             0x1UL                                     /**< Bit mask for CMU_LEUART0 */
#define _CMU_LFBCLKENMASK0_LEUART0_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for CMU_LFBCLKENMASK0 */
#define CMU_LFBCLKENMASK0_LEUART0_DEFAULT           (_CMU_LFBCLKENMASK0_LEUART0_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_LFBCLKENMASK0 */
#define CMU_LFBCLKENMASK0_LEUART1                   (0x1UL << 1)                              /**< Low Energy UART 1 Lock */
#define _CMU_LFBCLKENMASK0_LEUART1_SHIFT            1                                         /**< Shift value for CMU_LEUART1 */
#define _CMU_LFBCLKENMASK0_LEUART1_MASK             0x2UL                                     /**< Bit mask for CMU_LEUART1 */
#define _CMU_LFBCLKENMASK0_LEUART1_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for CMU_LFBCLKENMASK0 */
#define CMU_LFBCLKENMASK0_LEUART1_DEFAULT           (_CMU_LFBCLKENMASK0_LEUART1_DEFAULT << 1) /**< Shifted mode DEFAULT for CMU_LFBCLKENMASK0 */

/* Bit fields for CMU PCNTCLKENMASK */
#define _CMU_PCNTCLKENMASK_RESETVALUE               0x00000007UL                            /**< Default value for CMU_PCNTCLKENMASK */
#define _CMU_PCNTCLKENMASK_MASK                     0x00000007UL                            /**< Mask for CMU_PCNTCLKENMASK */
#define CMU_PCNTCLKENMASK_PCNT0                     (0x1UL << 0)                            /**< Pulse Counter 0 Lock */
#define _CMU_PCNTCLKENMASK_PCNT0_SHIFT              0                                       /**< Shift value for CMU_PCNT0 */
#define _CMU_PCNTCLKENMASK_PCNT0_MASK               0x1UL                                   /**< Bit mask for CMU_PCNT0 */
#define _CMU_PCNTCLKENMASK_PCNT0_DEFAULT            0x00000001UL                            /**< Mode DEFAULT for CMU_PCNTCLKENMASK */
#define CMU_PCNTCLKENMASK_PCNT0_DEFAULT             (_CMU_PCNTCLKENMASK_PCNT0_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_PCNTCLKENMASK */
#define CMU_PCNTCLKENMASK_PCNT1                     (0x1UL << 1)                            /**< Pulse Counter 1 Lock */
#define _CMU_PCNTCLKENMASK_PCNT1_SHIFT              1                                       /**< Shift value for CMU_PCNT1 */
#define _CMU_PCNTCLKENMASK_PCNT1_MASK               0x2UL                                   /**< Bit mask for CMU_PCNT1 */
#define _CMU_PCNTCLKENMASK_PCNT1_DEFAULT            0x00000001UL                            /**< Mode DEFAULT for CMU_PCNTCLKENMASK */
#define CMU_PCNTCLKENMASK_PCNT1_DEFAULT             (_CMU_PCNTCLKENMASK_PCNT1_DEFAULT << 1) /**< Shifted mode DEFAULT for CMU_PCNTCLKENMASK */
#define CMU_PCNTCLKENMASK_PCNT2                     (0x1UL << 2)                            /**< Pulse Counter 2 Lock */
#define _CMU_PCNTCLKENMASK_PCNT2_SHIFT              2                                       /**< Shift value for CMU_PCNT2 */
#define _CMU_PCNTCLKENMASK_PCNT2_MASK               0x4UL                                   /**< Bit mask for CMU_PCNT2 */
#define _CMU_PCNTCLKENMASK_PCNT2_DEFAULT            0x00000001UL                            /**< Mode DEFAULT for CMU_PCNTCLKENMASK */
#define CMU_PCNTCLKENMASK_PCNT2_DEFAULT             (_CMU_PCNTCLKENMASK_PCNT2_DEFAULT << 2) /**< Shifted mode DEFAULT for CMU_PCNTCLKENMASK */

/* Bit fields for CMU TEST */
#define _CMU_TEST_RESETVALUE                        0x00000524UL                                /**< Default value for CMU_TEST */
#define _CMU_TEST_MASK                              0x001F3FFFUL                                /**< Mask for CMU_TEST */
#define _CMU_TEST_HFRCOPROCCOMP_SHIFT               0                                           /**< Shift value for CMU_HFRCOPROCCOMP */
#define _CMU_TEST_HFRCOPROCCOMP_MASK                0x7UL                                       /**< Bit mask for CMU_HFRCOPROCCOMP */
#define _CMU_TEST_HFRCOPROCCOMP_DEFAULT             0x00000004UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_HFRCOPROCCOMP_DEFAULT              (_CMU_TEST_HFRCOPROCCOMP_DEFAULT << 0)      /**< Shifted mode DEFAULT for CMU_TEST */
#define _CMU_TEST_HFRCOSUPPLYCOMP_SHIFT             3                                           /**< Shift value for CMU_HFRCOSUPPLYCOMP */
#define _CMU_TEST_HFRCOSUPPLYCOMP_MASK              0x38UL                                      /**< Bit mask for CMU_HFRCOSUPPLYCOMP */
#define _CMU_TEST_HFRCOSUPPLYCOMP_DEFAULT           0x00000004UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_HFRCOSUPPLYCOMP_DEFAULT            (_CMU_TEST_HFRCOSUPPLYCOMP_DEFAULT << 3)    /**< Shifted mode DEFAULT for CMU_TEST */
#define _CMU_TEST_HFRCOTEMPCOMP_SHIFT               6                                           /**< Shift value for CMU_HFRCOTEMPCOMP */
#define _CMU_TEST_HFRCOTEMPCOMP_MASK                0x1C0UL                                     /**< Bit mask for CMU_HFRCOTEMPCOMP */
#define _CMU_TEST_HFRCOTEMPCOMP_DEFAULT             0x00000004UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_HFRCOTEMPCOMP_DEFAULT              (_CMU_TEST_HFRCOTEMPCOMP_DEFAULT << 6)      /**< Shifted mode DEFAULT for CMU_TEST */
#define _CMU_TEST_LFRCOPROCCOMP_SHIFT               9                                           /**< Shift value for CMU_LFRCOPROCCOMP */
#define _CMU_TEST_LFRCOPROCCOMP_MASK                0xE00UL                                     /**< Bit mask for CMU_LFRCOPROCCOMP */
#define _CMU_TEST_LFRCOPROCCOMP_DEFAULT             0x00000002UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LFRCOPROCCOMP_DEFAULT              (_CMU_TEST_LFRCOPROCCOMP_DEFAULT << 9)      /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LFRCOVREF100NAEN                   (0x1UL << 12)                               /**< Enable use of 100 nA instead 10 nA */
#define _CMU_TEST_LFRCOVREF100NAEN_SHIFT            12                                          /**< Shift value for CMU_LFRCOVREF100NAEN */
#define _CMU_TEST_LFRCOVREF100NAEN_MASK             0x1000UL                                    /**< Bit mask for CMU_LFRCOVREF100NAEN */
#define _CMU_TEST_LFRCOVREF100NAEN_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LFRCOVREF100NAEN_DEFAULT           (_CMU_TEST_LFRCOVREF100NAEN_DEFAULT << 12)  /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LFRCOLARGERCCAPEN                  (0x1UL << 13)                               /**< For 32 KHz program to 0, for 1 KHz program to 1 */
#define _CMU_TEST_LFRCOLARGERCCAPEN_SHIFT           13                                          /**< Shift value for CMU_LFRCOLARGERCCAPEN */
#define _CMU_TEST_LFRCOLARGERCCAPEN_MASK            0x2000UL                                    /**< Bit mask for CMU_LFRCOLARGERCCAPEN */
#define _CMU_TEST_LFRCOLARGERCCAPEN_DEFAULT         0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LFRCOLARGERCCAPEN_DEFAULT          (_CMU_TEST_LFRCOLARGERCCAPEN_DEFAULT << 13) /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCPRS                         (0x1UL << 16)                               /**< Enable PRS inputs to LE Write Synchronization circuit. R1 and R2 input is taken from two PRS channels defined in LEWSYNC-parameters LEWSYNC_PRS_R1_INPUT and LEWSYNC_PRS_R2_INPUT */
#define _CMU_TEST_LEWSYNCPRS_SHIFT                  16                                          /**< Shift value for CMU_LEWSYNCPRS */
#define _CMU_TEST_LEWSYNCPRS_MASK                   0x10000UL                                   /**< Bit mask for CMU_LEWSYNCPRS */
#define _CMU_TEST_LEWSYNCPRS_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCPRS_DEFAULT                 (_CMU_TEST_LEWSYNCPRS_DEFAULT << 16)        /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCBLOCK                       (0x1UL << 17)                               /**< Block all LE Write Synchronization Mutex cells */
#define _CMU_TEST_LEWSYNCBLOCK_SHIFT                17                                          /**< Shift value for CMU_LEWSYNCBLOCK */
#define _CMU_TEST_LEWSYNCBLOCK_MASK                 0x20000UL                                   /**< Bit mask for CMU_LEWSYNCBLOCK */
#define _CMU_TEST_LEWSYNCBLOCK_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCBLOCK_DEFAULT               (_CMU_TEST_LEWSYNCBLOCK_DEFAULT << 17)      /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCDELAY                       (0x1UL << 18)                               /**< Insert extra delays in all LEWSYNC delay chains */
#define _CMU_TEST_LEWSYNCDELAY_SHIFT                18                                          /**< Shift value for CMU_LEWSYNCDELAY */
#define _CMU_TEST_LEWSYNCDELAY_MASK                 0x40000UL                                   /**< Bit mask for CMU_LEWSYNCDELAY */
#define _CMU_TEST_LEWSYNCDELAY_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCDELAY_DEFAULT               (_CMU_TEST_LEWSYNCDELAY_DEFAULT << 18)      /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCOBS                         (0x1UL << 19)                               /**< Enable observation of LEWSYNC related PRS outputs (MUTG1,MIXCLK) */
#define _CMU_TEST_LEWSYNCOBS_SHIFT                  19                                          /**< Shift value for CMU_LEWSYNCOBS */
#define _CMU_TEST_LEWSYNCOBS_MASK                   0x80000UL                                   /**< Bit mask for CMU_LEWSYNCOBS */
#define _CMU_TEST_LEWSYNCOBS_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCOBS_DEFAULT                 (_CMU_TEST_LEWSYNCOBS_DEFAULT << 19)        /**< Shifted mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCOBSINV                      (0x1UL << 20)                               /**< Enable inverted observation of LEWSYNC related PRS outputs (MUTG1,RTCCLKAPBLE) */
#define _CMU_TEST_LEWSYNCOBSINV_SHIFT               20                                          /**< Shift value for CMU_LEWSYNCOBSINV */
#define _CMU_TEST_LEWSYNCOBSINV_MASK                0x100000UL                                  /**< Bit mask for CMU_LEWSYNCOBSINV */
#define _CMU_TEST_LEWSYNCOBSINV_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for CMU_TEST */
#define CMU_TEST_LEWSYNCOBSINV_DEFAULT              (_CMU_TEST_LEWSYNCOBSINV_DEFAULT << 20)     /**< Shifted mode DEFAULT for CMU_TEST */

