ARMmbed/DAPLink/source/common/cmsis-core/siliconlabs/efm32lg/efm32lgfull.h
/* Bit fields for CMU RST */
#define _CMU_RST_RESETVALUE                         0x00000000UL                  /**< Default value for CMU_RST */
#define _CMU_RST_MASK                               0x00000001UL                  /**< Mask for CMU_RST */
#define CMU_RST_LFRST                               (0x1UL << 0)                  /**< Low Frequency Reset */
#define _CMU_RST_LFRST_SHIFT                        0                             /**< Shift value for CMU_LFRST */
#define _CMU_RST_LFRST_MASK                         0x1UL                         /**< Bit mask for CMU_LFRST */
#define _CMU_RST_LFRST_DEFAULT                      0x00000000UL                  /**< Mode DEFAULT for CMU_RST */
#define CMU_RST_LFRST_DEFAULT                       (_CMU_RST_LFRST_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_RST */

/* Bit fields for CMU LPOSCCTRL */
#define _CMU_LPOSCCTRL_RESETVALUE                   0x00000012UL                               /**< Default value for CMU_LPOSCCTRL */
#define _CMU_LPOSCCTRL_MASK                         0x00000153UL                               /**< Mask for CMU_LPOSCCTRL */
#define _CMU_LPOSCCTRL_LFXOAMP_SHIFT                0                                          /**< Shift value for CMU_LFXOAMP */
#define _CMU_LPOSCCTRL_LFXOAMP_MASK                 0x3UL                                      /**< Bit mask for CMU_LFXOAMP */
#define _CMU_LPOSCCTRL_LFXOAMP_DEFAULT              0x00000002UL                               /**< Mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXOAMP_DEFAULT               (_CMU_LPOSCCTRL_LFXOAMP_DEFAULT << 0)      /**< Shifted mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXOCURR                      (0x1UL << 4)                               /**< LFXO Current */
#define _CMU_LPOSCCTRL_LFXOCURR_SHIFT               4                                          /**< Shift value for CMU_LFXOCURR */
#define _CMU_LPOSCCTRL_LFXOCURR_MASK                0x10UL                                     /**< Bit mask for CMU_LFXOCURR */
#define _CMU_LPOSCCTRL_LFXOCURR_DEFAULT             0x00000001UL                               /**< Mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXOCURR_DEFAULT              (_CMU_LPOSCCTRL_LFXOCURR_DEFAULT << 4)     /**< Shifted mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXOCORECURR                  (0x1UL << 6)                               /**< LFXO Core Current */
#define _CMU_LPOSCCTRL_LFXOCORECURR_SHIFT           6                                          /**< Shift value for CMU_LFXOCORECURR */
#define _CMU_LPOSCCTRL_LFXOCORECURR_MASK            0x40UL                                     /**< Bit mask for CMU_LFXOCORECURR */
#define _CMU_LPOSCCTRL_LFXOCORECURR_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXOCORECURR_DEFAULT          (_CMU_LPOSCCTRL_LFXOCORECURR_DEFAULT << 6) /**< Shifted mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXORES                       (0x1UL << 8)                               /**< LFXO Res */
#define _CMU_LPOSCCTRL_LFXORES_SHIFT                8                                          /**< Shift value for CMU_LFXORES */
#define _CMU_LPOSCCTRL_LFXORES_MASK                 0x100UL                                    /**< Bit mask for CMU_LFXORES */
#define _CMU_LPOSCCTRL_LFXORES_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for CMU_LPOSCCTRL */
#define CMU_LPOSCCTRL_LFXORES_DEFAULT               (_CMU_LPOSCCTRL_LFXORES_DEFAULT << 8)      /**< Shifted mode DEFAULT for CMU_LPOSCCTRL */

/* Bit fields for CMU EM4OSCCTRL */
#define _CMU_EM4OSCCTRL_RESETVALUE                  0x00000012UL                                /**< Default value for CMU_EM4OSCCTRL */
#define _CMU_EM4OSCCTRL_MASK                        0x00000153UL                                /**< Mask for CMU_EM4OSCCTRL */
#define _CMU_EM4OSCCTRL_LFXOAMP_SHIFT               0                                           /**< Shift value for CMU_LFXOAMP */
#define _CMU_EM4OSCCTRL_LFXOAMP_MASK                0x3UL                                       /**< Bit mask for CMU_LFXOAMP */
#define _CMU_EM4OSCCTRL_LFXOAMP_DEFAULT             0x00000002UL                                /**< Mode DEFAULT for CMU_EM4OSCCTRL */
#define CMU_EM4OSCCTRL_LFXOAMP_DEFAULT              (_CMU_EM4OSCCTRL_LFXOAMP_DEFAULT << 0)      /**< Shifted mode DEFAULT for CMU_EM4OSCCTRL */
#define CMU_EM4OSCCTRL_LFXOCURR                     (0x1UL << 4)                                /**< LFXO Current */
#define _CMU_EM4OSCCTRL_LFXOCURR_SHIFT              4                                           /**< Shift value for CMU_LFXOCURR */
#define _CMU_EM4OSCCTRL_LFXOCURR_MASK               0x10UL                                      /**< Bit mask for CMU_LFXOCURR */
#define _CMU_EM4OSCCTRL_LFXOCURR_DEFAULT            0x00000001UL                                /**< Mode DEFAULT for CMU_EM4OSCCTRL */
#define CMU_EM4OSCCTRL_LFXOCURR_DEFAULT             (_CMU_EM4OSCCTRL_LFXOCURR_DEFAULT << 4)     /**< Shifted mode DEFAULT for CMU_EM4OSCCTRL */
#define CMU_EM4OSCCTRL_LFXOCORECURR                 (0x1UL << 6)                                /**< LFXO Core Current */
#define _CMU_EM4OSCCTRL_LFXOCORECURR_SHIFT          6                                           /**< Shift value for CMU_LFXOCORECURR */
#define _CMU_EM4OSCCTRL_LFXOCORECURR_MASK           0x40UL                                      /**< Bit mask for CMU_LFXOCORECURR */
#define _CMU_EM4OSCCTRL_LFXOCORECURR_DEFAULT        0x00000000UL                                /**< Mode DEFAULT for CMU_EM4OSCCTRL */
#define CMU_EM4OSCCTRL_LFXOCORECURR_DEFAULT         (_CMU_EM4OSCCTRL_LFXOCORECURR_DEFAULT << 6) /**< Shifted mode DEFAULT for CMU_EM4OSCCTRL */
#define CMU_EM4OSCCTRL_LFXORES                      (0x1UL << 8)                                /**< LFXO Res */
#define _CMU_EM4OSCCTRL_LFXORES_SHIFT               8                                           /**< Shift value for CMU_LFXORES */
#define _CMU_EM4OSCCTRL_LFXORES_MASK                0x100UL                                     /**< Bit mask for CMU_LFXORES */
#define _CMU_EM4OSCCTRL_LFXORES_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for CMU_EM4OSCCTRL */
#define CMU_EM4OSCCTRL_LFXORES_DEFAULT              (_CMU_EM4OSCCTRL_LFXORES_DEFAULT << 8)      /**< Shifted mode DEFAULT for CMU_EM4OSCCTRL */

/** @} End of group EFM32LGFULL_CMU */


/**************************************************************************//**
 * @defgroup EFM32LGFULL_LESENSE_BitFields  EFM32LGFULL_LESENSE Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for LESENSE CTRL */
#define _LESENSE_CTRL_RESETVALUE                       0x00000000UL                             /**< Default value for LESENSE_CTRL */
#define _LESENSE_CTRL_MASK                             0x00772EFFUL                             /**< Mask for LESENSE_CTRL */
#define _LESENSE_CTRL_SCANMODE_SHIFT                   0                                        /**< Shift value for LESENSE_SCANMODE */
#define _LESENSE_CTRL_SCANMODE_MASK                    0x3UL                                    /**< Bit mask for LESENSE_SCANMODE */
#define _LESENSE_CTRL_SCANMODE_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for LESENSE_CTRL */
#define _LESENSE_CTRL_SCANMODE_PERIODIC                0x00000000UL                             /**< Mode PERIODIC for LESENSE_CTRL */
#define _LESENSE_CTRL_SCANMODE_ONESHOT                 0x00000001UL                             /**< Mode ONESHOT for LESENSE_CTRL */
#define _LESENSE_CTRL_SCANMODE_PRS                     0x00000002UL                             /**< Mode PRS for LESENSE_CTRL */
#define LESENSE_CTRL_SCANMODE_DEFAULT                  (_LESENSE_CTRL_SCANMODE_DEFAULT << 0)    /**< Shifted mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_SCANMODE_PERIODIC                 (_LESENSE_CTRL_SCANMODE_PERIODIC << 0)   /**< Shifted mode PERIODIC for LESENSE_CTRL */
#define LESENSE_CTRL_SCANMODE_ONESHOT                  (_LESENSE_CTRL_SCANMODE_ONESHOT << 0)    /**< Shifted mode ONESHOT for LESENSE_CTRL */
#define LESENSE_CTRL_SCANMODE_PRS                      (_LESENSE_CTRL_SCANMODE_PRS << 0)        /**< Shifted mode PRS for LESENSE_CTRL */
#define _LESENSE_CTRL_PRSSEL_SHIFT                     2                                        /**< Shift value for LESENSE_PRSSEL */
#define _LESENSE_CTRL_PRSSEL_MASK                      0x3CUL                                   /**< Bit mask for LESENSE_PRSSEL */
#define _LESENSE_CTRL_PRSSEL_DEFAULT                   0x00000000UL                             /**< Mode DEFAULT for LESENSE_CTRL */
#define _LESENSE_CTRL_PRSSEL_PRSCH0                    0x00000000UL                             /**< Mode PRSCH0 for LESENSE_CTRL */
#define _LESENSE_CTRL_PRSSEL_PRSCH1                    0x00000001UL                             /**< Mode PRSCH1 for LESENSE_CTRL */
#define _LESENSE_CTRL_PRSSEL_PRSCH2                    0x00000002UL                             /**< Mode PRSCH2 for LESENSE_CTRL */
#define _LESENSE_CTRL_PRSSEL_PRSCH3                    0x00000003UL                             /**< Mode PRSCH3 for LESENSE_CTRL */
#define _LESENSE_CTRL_PRSSEL_PRSCH4                    0x00000004UL                             /**< Mode PRSCH4 for LESENSE_CTRL */
#define _LESENSE_CTRL_PRSSEL_PRSCH5                    0x00000005UL                             /**< Mode PRSCH5 for LESENSE_CTRL */
#define _LESENSE_CTRL_PRSSEL_PRSCH6                    0x00000006UL                             /**< Mode PRSCH6 for LESENSE_CTRL */
#define _LESENSE_CTRL_PRSSEL_PRSCH7                    0x00000007UL                             /**< Mode PRSCH7 for LESENSE_CTRL */
#define _LESENSE_CTRL_PRSSEL_PRSCH8                    0x00000008UL                             /**< Mode PRSCH8 for LESENSE_CTRL */
#define _LESENSE_CTRL_PRSSEL_PRSCH9                    0x00000009UL                             /**< Mode PRSCH9 for LESENSE_CTRL */
#define _LESENSE_CTRL_PRSSEL_PRSCH10                   0x0000000AUL                             /**< Mode PRSCH10 for LESENSE_CTRL */
#define _LESENSE_CTRL_PRSSEL_PRSCH11                   0x0000000BUL                             /**< Mode PRSCH11 for LESENSE_CTRL */
#define LESENSE_CTRL_PRSSEL_DEFAULT                    (_LESENSE_CTRL_PRSSEL_DEFAULT << 2)      /**< Shifted mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_PRSSEL_PRSCH0                     (_LESENSE_CTRL_PRSSEL_PRSCH0 << 2)       /**< Shifted mode PRSCH0 for LESENSE_CTRL */
#define LESENSE_CTRL_PRSSEL_PRSCH1                     (_LESENSE_CTRL_PRSSEL_PRSCH1 << 2)       /**< Shifted mode PRSCH1 for LESENSE_CTRL */
#define LESENSE_CTRL_PRSSEL_PRSCH2                     (_LESENSE_CTRL_PRSSEL_PRSCH2 << 2)       /**< Shifted mode PRSCH2 for LESENSE_CTRL */
#define LESENSE_CTRL_PRSSEL_PRSCH3                     (_LESENSE_CTRL_PRSSEL_PRSCH3 << 2)       /**< Shifted mode PRSCH3 for LESENSE_CTRL */
#define LESENSE_CTRL_PRSSEL_PRSCH4                     (_LESENSE_CTRL_PRSSEL_PRSCH4 << 2)       /**< Shifted mode PRSCH4 for LESENSE_CTRL */
#define LESENSE_CTRL_PRSSEL_PRSCH5                     (_LESENSE_CTRL_PRSSEL_PRSCH5 << 2)       /**< Shifted mode PRSCH5 for LESENSE_CTRL */
#define LESENSE_CTRL_PRSSEL_PRSCH6                     (_LESENSE_CTRL_PRSSEL_PRSCH6 << 2)       /**< Shifted mode PRSCH6 for LESENSE_CTRL */
#define LESENSE_CTRL_PRSSEL_PRSCH7                     (_LESENSE_CTRL_PRSSEL_PRSCH7 << 2)       /**< Shifted mode PRSCH7 for LESENSE_CTRL */
#define LESENSE_CTRL_PRSSEL_PRSCH8                     (_LESENSE_CTRL_PRSSEL_PRSCH8 << 2)       /**< Shifted mode PRSCH8 for LESENSE_CTRL */
#define LESENSE_CTRL_PRSSEL_PRSCH9                     (_LESENSE_CTRL_PRSSEL_PRSCH9 << 2)       /**< Shifted mode PRSCH9 for LESENSE_CTRL */
#define LESENSE_CTRL_PRSSEL_PRSCH10                    (_LESENSE_CTRL_PRSSEL_PRSCH10 << 2)      /**< Shifted mode PRSCH10 for LESENSE_CTRL */
#define LESENSE_CTRL_PRSSEL_PRSCH11                    (_LESENSE_CTRL_PRSSEL_PRSCH11 << 2)      /**< Shifted mode PRSCH11 for LESENSE_CTRL */
#define _LESENSE_CTRL_SCANCONF_SHIFT                   6                                        /**< Shift value for LESENSE_SCANCONF */
#define _LESENSE_CTRL_SCANCONF_MASK                    0xC0UL                                   /**< Bit mask for LESENSE_SCANCONF */
#define _LESENSE_CTRL_SCANCONF_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for LESENSE_CTRL */
#define _LESENSE_CTRL_SCANCONF_DIRMAP                  0x00000000UL                             /**< Mode DIRMAP for LESENSE_CTRL */
#define _LESENSE_CTRL_SCANCONF_INVMAP                  0x00000001UL                             /**< Mode INVMAP for LESENSE_CTRL */
#define _LESENSE_CTRL_SCANCONF_TOGGLE                  0x00000002UL                             /**< Mode TOGGLE for LESENSE_CTRL */
#define _LESENSE_CTRL_SCANCONF_DECDEF                  0x00000003UL                             /**< Mode DECDEF for LESENSE_CTRL */
#define LESENSE_CTRL_SCANCONF_DEFAULT                  (_LESENSE_CTRL_SCANCONF_DEFAULT << 6)    /**< Shifted mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_SCANCONF_DIRMAP                   (_LESENSE_CTRL_SCANCONF_DIRMAP << 6)     /**< Shifted mode DIRMAP for LESENSE_CTRL */
#define LESENSE_CTRL_SCANCONF_INVMAP                   (_LESENSE_CTRL_SCANCONF_INVMAP << 6)     /**< Shifted mode INVMAP for LESENSE_CTRL */
#define LESENSE_CTRL_SCANCONF_TOGGLE                   (_LESENSE_CTRL_SCANCONF_TOGGLE << 6)     /**< Shifted mode TOGGLE for LESENSE_CTRL */
#define LESENSE_CTRL_SCANCONF_DECDEF                   (_LESENSE_CTRL_SCANCONF_DECDEF << 6)     /**< Shifted mode DECDEF for LESENSE_CTRL */
#define LESENSE_CTRL_ACMP0INV                          (0x1UL << 9)                             /**< Invert analog comparator 0 output */
#define _LESENSE_CTRL_ACMP0INV_SHIFT                   9                                        /**< Shift value for LESENSE_ACMP0INV */
#define _LESENSE_CTRL_ACMP0INV_MASK                    0x200UL                                  /**< Bit mask for LESENSE_ACMP0INV */
#define _LESENSE_CTRL_ACMP0INV_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_ACMP0INV_DEFAULT                  (_LESENSE_CTRL_ACMP0INV_DEFAULT << 9)    /**< Shifted mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_ACMP1INV                          (0x1UL << 10)                            /**< Invert analog comparator 1 output */
#define _LESENSE_CTRL_ACMP1INV_SHIFT                   10                                       /**< Shift value for LESENSE_ACMP1INV */
#define _LESENSE_CTRL_ACMP1INV_MASK                    0x400UL                                  /**< Bit mask for LESENSE_ACMP1INV */
#define _LESENSE_CTRL_ACMP1INV_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_ACMP1INV_DEFAULT                  (_LESENSE_CTRL_ACMP1INV_DEFAULT << 10)   /**< Shifted mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_ALTEXMAP                          (0x1UL << 11)                            /**< Alternative excitation map */
#define _LESENSE_CTRL_ALTEXMAP_SHIFT                   11                                       /**< Shift value for LESENSE_ALTEXMAP */
#define _LESENSE_CTRL_ALTEXMAP_MASK                    0x800UL                                  /**< Bit mask for LESENSE_ALTEXMAP */
#define _LESENSE_CTRL_ALTEXMAP_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for LESENSE_CTRL */
#define _LESENSE_CTRL_ALTEXMAP_ALTEX                   0x00000000UL                             /**< Mode ALTEX for LESENSE_CTRL */
#define _LESENSE_CTRL_ALTEXMAP_ACMP                    0x00000001UL                             /**< Mode ACMP for LESENSE_CTRL */
#define LESENSE_CTRL_ALTEXMAP_DEFAULT                  (_LESENSE_CTRL_ALTEXMAP_DEFAULT << 11)   /**< Shifted mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_ALTEXMAP_ALTEX                    (_LESENSE_CTRL_ALTEXMAP_ALTEX << 11)     /**< Shifted mode ALTEX for LESENSE_CTRL */
#define LESENSE_CTRL_ALTEXMAP_ACMP                     (_LESENSE_CTRL_ALTEXMAP_ACMP << 11)      /**< Shifted mode ACMP for LESENSE_CTRL */
#define LESENSE_CTRL_DUALSAMPLE                        (0x1UL << 13)                            /**< Enable dual sample mode */
#define _LESENSE_CTRL_DUALSAMPLE_SHIFT                 13                                       /**< Shift value for LESENSE_DUALSAMPLE */
#define _LESENSE_CTRL_DUALSAMPLE_MASK                  0x2000UL                                 /**< Bit mask for LESENSE_DUALSAMPLE */
#define _LESENSE_CTRL_DUALSAMPLE_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_DUALSAMPLE_DEFAULT                (_LESENSE_CTRL_DUALSAMPLE_DEFAULT << 13) /**< Shifted mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_BUFOW                             (0x1UL << 16)                            /**< Result buffer overwrite */
#define _LESENSE_CTRL_BUFOW_SHIFT                      16                                       /**< Shift value for LESENSE_BUFOW */
#define _LESENSE_CTRL_BUFOW_MASK                       0x10000UL                                /**< Bit mask for LESENSE_BUFOW */
#define _LESENSE_CTRL_BUFOW_DEFAULT                    0x00000000UL                             /**< Mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_BUFOW_DEFAULT                     (_LESENSE_CTRL_BUFOW_DEFAULT << 16)      /**< Shifted mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_STRSCANRES                        (0x1UL << 17)                            /**< Enable storing of SCANRES */
#define _LESENSE_CTRL_STRSCANRES_SHIFT                 17                                       /**< Shift value for LESENSE_STRSCANRES */
#define _LESENSE_CTRL_STRSCANRES_MASK                  0x20000UL                                /**< Bit mask for LESENSE_STRSCANRES */
#define _LESENSE_CTRL_STRSCANRES_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_STRSCANRES_DEFAULT                (_LESENSE_CTRL_STRSCANRES_DEFAULT << 17) /**< Shifted mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_BUFIDL                            (0x1UL << 18)                            /**< Result buffer interrupt and DMA trigger level */
#define _LESENSE_CTRL_BUFIDL_SHIFT                     18                                       /**< Shift value for LESENSE_BUFIDL */
#define _LESENSE_CTRL_BUFIDL_MASK                      0x40000UL                                /**< Bit mask for LESENSE_BUFIDL */
#define _LESENSE_CTRL_BUFIDL_DEFAULT                   0x00000000UL                             /**< Mode DEFAULT for LESENSE_CTRL */
#define _LESENSE_CTRL_BUFIDL_HALFFULL                  0x00000000UL                             /**< Mode HALFFULL for LESENSE_CTRL */
#define _LESENSE_CTRL_BUFIDL_FULL                      0x00000001UL                             /**< Mode FULL for LESENSE_CTRL */
#define LESENSE_CTRL_BUFIDL_DEFAULT                    (_LESENSE_CTRL_BUFIDL_DEFAULT << 18)     /**< Shifted mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_BUFIDL_HALFFULL                   (_LESENSE_CTRL_BUFIDL_HALFFULL << 18)    /**< Shifted mode HALFFULL for LESENSE_CTRL */
#define LESENSE_CTRL_BUFIDL_FULL                       (_LESENSE_CTRL_BUFIDL_FULL << 18)        /**< Shifted mode FULL for LESENSE_CTRL */
#define _LESENSE_CTRL_DMAWU_SHIFT                      20                                       /**< Shift value for LESENSE_DMAWU */
#define _LESENSE_CTRL_DMAWU_MASK                       0x300000UL                               /**< Bit mask for LESENSE_DMAWU */
#define _LESENSE_CTRL_DMAWU_DEFAULT                    0x00000000UL                             /**< Mode DEFAULT for LESENSE_CTRL */
#define _LESENSE_CTRL_DMAWU_DISABLE                    0x00000000UL                             /**< Mode DISABLE for LESENSE_CTRL */
#define _LESENSE_CTRL_DMAWU_BUFDATAV                   0x00000001UL                             /**< Mode BUFDATAV for LESENSE_CTRL */
#define _LESENSE_CTRL_DMAWU_BUFLEVEL                   0x00000002UL                             /**< Mode BUFLEVEL for LESENSE_CTRL */
#define LESENSE_CTRL_DMAWU_DEFAULT                     (_LESENSE_CTRL_DMAWU_DEFAULT << 20)      /**< Shifted mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_DMAWU_DISABLE                     (_LESENSE_CTRL_DMAWU_DISABLE << 20)      /**< Shifted mode DISABLE for LESENSE_CTRL */
#define LESENSE_CTRL_DMAWU_BUFDATAV                    (_LESENSE_CTRL_DMAWU_BUFDATAV << 20)     /**< Shifted mode BUFDATAV for LESENSE_CTRL */
#define LESENSE_CTRL_DMAWU_BUFLEVEL                    (_LESENSE_CTRL_DMAWU_BUFLEVEL << 20)     /**< Shifted mode BUFLEVEL for LESENSE_CTRL */
#define LESENSE_CTRL_DEBUGRUN                          (0x1UL << 22)                            /**< Debug Mode Run Enable */
#define _LESENSE_CTRL_DEBUGRUN_SHIFT                   22                                       /**< Shift value for LESENSE_DEBUGRUN */
#define _LESENSE_CTRL_DEBUGRUN_MASK                    0x400000UL                               /**< Bit mask for LESENSE_DEBUGRUN */
#define _LESENSE_CTRL_DEBUGRUN_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for LESENSE_CTRL */
#define LESENSE_CTRL_DEBUGRUN_DEFAULT                  (_LESENSE_CTRL_DEBUGRUN_DEFAULT << 22)   /**< Shifted mode DEFAULT for LESENSE_CTRL */

