ARMmbed/DAPLink/source/common/cmsis-core/siliconlabs/efm32lg/efm32lgfull.h
#define PRS_CH_CTRL_SIGSEL_TIMER3CC0             (_PRS_CH_CTRL_SIGSEL_TIMER3CC0 << 0)         /**< Shifted mode TIMER3CC0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_RTCCOMP1              (_PRS_CH_CTRL_SIGSEL_RTCCOMP1 << 0)          /**< Shifted mode RTCCOMP1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_UART0RXDATAV          (_PRS_CH_CTRL_SIGSEL_UART0RXDATAV << 0)      /**< Shifted mode UART0RXDATAV for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_UART1RXDATAV          (_PRS_CH_CTRL_SIGSEL_UART1RXDATAV << 0)      /**< Shifted mode UART1RXDATAV for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN2              (_PRS_CH_CTRL_SIGSEL_GPIOPIN2 << 0)          /**< Shifted mode GPIOPIN2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN10             (_PRS_CH_CTRL_SIGSEL_GPIOPIN10 << 0)         /**< Shifted mode GPIOPIN10 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES2       (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES2 << 0)   /**< Shifted mode LESENSESCANRES2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES10      (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES10 << 0)  /**< Shifted mode LESENSESCANRES10 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSEDEC2           (_PRS_CH_CTRL_SIGSEL_LESENSEDEC2 << 0)       /**< Shifted mode LESENSEDEC2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_MANTESTLFAPULSE       (_PRS_CH_CTRL_SIGSEL_MANTESTLFAPULSE << 0)   /**< Shifted mode MANTESTLFAPULSE for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER0CC1             (_PRS_CH_CTRL_SIGSEL_TIMER0CC1 << 0)         /**< Shifted mode TIMER0CC1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER1CC1             (_PRS_CH_CTRL_SIGSEL_TIMER1CC1 << 0)         /**< Shifted mode TIMER1CC1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER2CC1             (_PRS_CH_CTRL_SIGSEL_TIMER2CC1 << 0)         /**< Shifted mode TIMER2CC1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER3CC1             (_PRS_CH_CTRL_SIGSEL_TIMER3CC1 << 0)         /**< Shifted mode TIMER3CC1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN3              (_PRS_CH_CTRL_SIGSEL_GPIOPIN3 << 0)          /**< Shifted mode GPIOPIN3 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN11             (_PRS_CH_CTRL_SIGSEL_GPIOPIN11 << 0)         /**< Shifted mode GPIOPIN11 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES3       (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES3 << 0)   /**< Shifted mode LESENSESCANRES3 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES11      (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES11 << 0)  /**< Shifted mode LESENSESCANRES11 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_MANTESTGMCCALACT      (_PRS_CH_CTRL_SIGSEL_MANTESTGMCCALACT << 0)  /**< Shifted mode MANTESTGMCCALACT for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER0CC2             (_PRS_CH_CTRL_SIGSEL_TIMER0CC2 << 0)         /**< Shifted mode TIMER0CC2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER1CC2             (_PRS_CH_CTRL_SIGSEL_TIMER1CC2 << 0)         /**< Shifted mode TIMER1CC2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER2CC2             (_PRS_CH_CTRL_SIGSEL_TIMER2CC2 << 0)         /**< Shifted mode TIMER2CC2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_TIMER3CC2             (_PRS_CH_CTRL_SIGSEL_TIMER3CC2 << 0)         /**< Shifted mode TIMER3CC2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN4              (_PRS_CH_CTRL_SIGSEL_GPIOPIN4 << 0)          /**< Shifted mode GPIOPIN4 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN12             (_PRS_CH_CTRL_SIGSEL_GPIOPIN12 << 0)         /**< Shifted mode GPIOPIN12 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES4       (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES4 << 0)   /**< Shifted mode LESENSESCANRES4 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES12      (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES12 << 0)  /**< Shifted mode LESENSESCANRES12 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN5              (_PRS_CH_CTRL_SIGSEL_GPIOPIN5 << 0)          /**< Shifted mode GPIOPIN5 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN13             (_PRS_CH_CTRL_SIGSEL_GPIOPIN13 << 0)         /**< Shifted mode GPIOPIN13 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES5       (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES5 << 0)   /**< Shifted mode LESENSESCANRES5 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES13      (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES13 << 0)  /**< Shifted mode LESENSESCANRES13 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN6              (_PRS_CH_CTRL_SIGSEL_GPIOPIN6 << 0)          /**< Shifted mode GPIOPIN6 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN14             (_PRS_CH_CTRL_SIGSEL_GPIOPIN14 << 0)         /**< Shifted mode GPIOPIN14 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES6       (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES6 << 0)   /**< Shifted mode LESENSESCANRES6 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES14      (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES14 << 0)  /**< Shifted mode LESENSESCANRES14 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN7              (_PRS_CH_CTRL_SIGSEL_GPIOPIN7 << 0)          /**< Shifted mode GPIOPIN7 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_GPIOPIN15             (_PRS_CH_CTRL_SIGSEL_GPIOPIN15 << 0)         /**< Shifted mode GPIOPIN15 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES7       (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES7 << 0)   /**< Shifted mode LESENSESCANRES7 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SIGSEL_LESENSESCANRES15      (_PRS_CH_CTRL_SIGSEL_LESENSESCANRES15 << 0)  /**< Shifted mode LESENSESCANRES15 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_SHIFT             16                                           /**< Shift value for PRS_SOURCESEL */
#define _PRS_CH_CTRL_SOURCESEL_MASK              0x3F0000UL                                   /**< Bit mask for PRS_SOURCESEL */
#define _PRS_CH_CTRL_SOURCESEL_NONE              0x00000000UL                                 /**< Mode NONE for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_VCMP              0x00000001UL                                 /**< Mode VCMP for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_ACMP0             0x00000002UL                                 /**< Mode ACMP0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_ACMP1             0x00000003UL                                 /**< Mode ACMP1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_DAC0              0x00000006UL                                 /**< Mode DAC0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_ADC0              0x00000008UL                                 /**< Mode ADC0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_USART0            0x00000010UL                                 /**< Mode USART0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_USART1            0x00000011UL                                 /**< Mode USART1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_USART2            0x00000012UL                                 /**< Mode USART2 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_TIMER0            0x0000001CUL                                 /**< Mode TIMER0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_TIMER1            0x0000001DUL                                 /**< Mode TIMER1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_TIMER2            0x0000001EUL                                 /**< Mode TIMER2 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_TIMER3            0x0000001FUL                                 /**< Mode TIMER3 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_USB               0x00000024UL                                 /**< Mode USB for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_RTC               0x00000028UL                                 /**< Mode RTC for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_UART0             0x00000029UL                                 /**< Mode UART0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_UART1             0x0000002AUL                                 /**< Mode UART1 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_GPIOL             0x00000030UL                                 /**< Mode GPIOL for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_GPIOH             0x00000031UL                                 /**< Mode GPIOH for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_LETIMER0          0x00000034UL                                 /**< Mode LETIMER0 for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_BURTC             0x00000037UL                                 /**< Mode BURTC for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_LESENSEL          0x00000039UL                                 /**< Mode LESENSEL for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_LESENSEH          0x0000003AUL                                 /**< Mode LESENSEH for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_LESENSED          0x0000003BUL                                 /**< Mode LESENSED for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_LETEST            0x0000003EUL                                 /**< Mode LETEST for PRS_CH_CTRL */
#define _PRS_CH_CTRL_SOURCESEL_MANTEST           0x0000003FUL                                 /**< Mode MANTEST for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_NONE               (_PRS_CH_CTRL_SOURCESEL_NONE << 16)          /**< Shifted mode NONE for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_VCMP               (_PRS_CH_CTRL_SOURCESEL_VCMP << 16)          /**< Shifted mode VCMP for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_ACMP0              (_PRS_CH_CTRL_SOURCESEL_ACMP0 << 16)         /**< Shifted mode ACMP0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_ACMP1              (_PRS_CH_CTRL_SOURCESEL_ACMP1 << 16)         /**< Shifted mode ACMP1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_DAC0               (_PRS_CH_CTRL_SOURCESEL_DAC0 << 16)          /**< Shifted mode DAC0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_ADC0               (_PRS_CH_CTRL_SOURCESEL_ADC0 << 16)          /**< Shifted mode ADC0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_USART0             (_PRS_CH_CTRL_SOURCESEL_USART0 << 16)        /**< Shifted mode USART0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_USART1             (_PRS_CH_CTRL_SOURCESEL_USART1 << 16)        /**< Shifted mode USART1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_USART2             (_PRS_CH_CTRL_SOURCESEL_USART2 << 16)        /**< Shifted mode USART2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_TIMER0             (_PRS_CH_CTRL_SOURCESEL_TIMER0 << 16)        /**< Shifted mode TIMER0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_TIMER1             (_PRS_CH_CTRL_SOURCESEL_TIMER1 << 16)        /**< Shifted mode TIMER1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_TIMER2             (_PRS_CH_CTRL_SOURCESEL_TIMER2 << 16)        /**< Shifted mode TIMER2 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_TIMER3             (_PRS_CH_CTRL_SOURCESEL_TIMER3 << 16)        /**< Shifted mode TIMER3 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_USB                (_PRS_CH_CTRL_SOURCESEL_USB << 16)           /**< Shifted mode USB for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_RTC                (_PRS_CH_CTRL_SOURCESEL_RTC << 16)           /**< Shifted mode RTC for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_UART0              (_PRS_CH_CTRL_SOURCESEL_UART0 << 16)         /**< Shifted mode UART0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_UART1              (_PRS_CH_CTRL_SOURCESEL_UART1 << 16)         /**< Shifted mode UART1 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_GPIOL              (_PRS_CH_CTRL_SOURCESEL_GPIOL << 16)         /**< Shifted mode GPIOL for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_GPIOH              (_PRS_CH_CTRL_SOURCESEL_GPIOH << 16)         /**< Shifted mode GPIOH for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_LETIMER0           (_PRS_CH_CTRL_SOURCESEL_LETIMER0 << 16)      /**< Shifted mode LETIMER0 for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_BURTC              (_PRS_CH_CTRL_SOURCESEL_BURTC << 16)         /**< Shifted mode BURTC for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_LESENSEL           (_PRS_CH_CTRL_SOURCESEL_LESENSEL << 16)      /**< Shifted mode LESENSEL for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_LESENSEH           (_PRS_CH_CTRL_SOURCESEL_LESENSEH << 16)      /**< Shifted mode LESENSEH for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_LESENSED           (_PRS_CH_CTRL_SOURCESEL_LESENSED << 16)      /**< Shifted mode LESENSED for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_LETEST             (_PRS_CH_CTRL_SOURCESEL_LETEST << 16)        /**< Shifted mode LETEST for PRS_CH_CTRL */
#define PRS_CH_CTRL_SOURCESEL_MANTEST            (_PRS_CH_CTRL_SOURCESEL_MANTEST << 16)       /**< Shifted mode MANTEST for PRS_CH_CTRL */
#define _PRS_CH_CTRL_EDSEL_SHIFT                 24                                           /**< Shift value for PRS_EDSEL */
#define _PRS_CH_CTRL_EDSEL_MASK                  0x3000000UL                                  /**< Bit mask for PRS_EDSEL */
#define _PRS_CH_CTRL_EDSEL_DEFAULT               0x00000000UL                                 /**< Mode DEFAULT for PRS_CH_CTRL */
#define _PRS_CH_CTRL_EDSEL_OFF                   0x00000000UL                                 /**< Mode OFF for PRS_CH_CTRL */
#define _PRS_CH_CTRL_EDSEL_POSEDGE               0x00000001UL                                 /**< Mode POSEDGE for PRS_CH_CTRL */
#define _PRS_CH_CTRL_EDSEL_NEGEDGE               0x00000002UL                                 /**< Mode NEGEDGE for PRS_CH_CTRL */
#define _PRS_CH_CTRL_EDSEL_BOTHEDGES             0x00000003UL                                 /**< Mode BOTHEDGES for PRS_CH_CTRL */
#define PRS_CH_CTRL_EDSEL_DEFAULT                (_PRS_CH_CTRL_EDSEL_DEFAULT << 24)           /**< Shifted mode DEFAULT for PRS_CH_CTRL */
#define PRS_CH_CTRL_EDSEL_OFF                    (_PRS_CH_CTRL_EDSEL_OFF << 24)               /**< Shifted mode OFF for PRS_CH_CTRL */
#define PRS_CH_CTRL_EDSEL_POSEDGE                (_PRS_CH_CTRL_EDSEL_POSEDGE << 24)           /**< Shifted mode POSEDGE for PRS_CH_CTRL */
#define PRS_CH_CTRL_EDSEL_NEGEDGE                (_PRS_CH_CTRL_EDSEL_NEGEDGE << 24)           /**< Shifted mode NEGEDGE for PRS_CH_CTRL */
#define PRS_CH_CTRL_EDSEL_BOTHEDGES              (_PRS_CH_CTRL_EDSEL_BOTHEDGES << 24)         /**< Shifted mode BOTHEDGES for PRS_CH_CTRL */
#define PRS_CH_CTRL_ASYNC                        (0x1UL << 28)                                /**< Asynchronous reflex */
#define _PRS_CH_CTRL_ASYNC_SHIFT                 28                                           /**< Shift value for PRS_ASYNC */
#define _PRS_CH_CTRL_ASYNC_MASK                  0x10000000UL                                 /**< Bit mask for PRS_ASYNC */
#define _PRS_CH_CTRL_ASYNC_DEFAULT               0x00000000UL                                 /**< Mode DEFAULT for PRS_CH_CTRL */
#define PRS_CH_CTRL_ASYNC_DEFAULT                (_PRS_CH_CTRL_ASYNC_DEFAULT << 28)           /**< Shifted mode DEFAULT for PRS_CH_CTRL */

/** @} End of group EFM32LGFULL_PRS */



/**************************************************************************//**
 * @defgroup EFM32LGFULL_LCD_BitFields  EFM32LGFULL_LCD Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for LCD CTRL */
#define _LCD_CTRL_RESETVALUE               0x00000000UL                       /**< Default value for LCD_CTRL */
#define _LCD_CTRL_MASK                     0x00800007UL                       /**< Mask for LCD_CTRL */
#define LCD_CTRL_EN                        (0x1UL << 0)                       /**< LCD Enable */
#define _LCD_CTRL_EN_SHIFT                 0                                  /**< Shift value for LCD_EN */
#define _LCD_CTRL_EN_MASK                  0x1UL                              /**< Bit mask for LCD_EN */
#define _LCD_CTRL_EN_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for LCD_CTRL */
#define LCD_CTRL_EN_DEFAULT                (_LCD_CTRL_EN_DEFAULT << 0)        /**< Shifted mode DEFAULT for LCD_CTRL */
#define _LCD_CTRL_UDCTRL_SHIFT             1                                  /**< Shift value for LCD_UDCTRL */
#define _LCD_CTRL_UDCTRL_MASK              0x6UL                              /**< Bit mask for LCD_UDCTRL */
#define _LCD_CTRL_UDCTRL_DEFAULT           0x00000000UL                       /**< Mode DEFAULT for LCD_CTRL */
#define _LCD_CTRL_UDCTRL_REGULAR           0x00000000UL                       /**< Mode REGULAR for LCD_CTRL */
#define _LCD_CTRL_UDCTRL_FCEVENT           0x00000001UL                       /**< Mode FCEVENT for LCD_CTRL */
#define _LCD_CTRL_UDCTRL_FRAMESTART        0x00000002UL                       /**< Mode FRAMESTART for LCD_CTRL */
#define LCD_CTRL_UDCTRL_DEFAULT            (_LCD_CTRL_UDCTRL_DEFAULT << 1)    /**< Shifted mode DEFAULT for LCD_CTRL */
#define LCD_CTRL_UDCTRL_REGULAR            (_LCD_CTRL_UDCTRL_REGULAR << 1)    /**< Shifted mode REGULAR for LCD_CTRL */
#define LCD_CTRL_UDCTRL_FCEVENT            (_LCD_CTRL_UDCTRL_FCEVENT << 1)    /**< Shifted mode FCEVENT for LCD_CTRL */
#define LCD_CTRL_UDCTRL_FRAMESTART         (_LCD_CTRL_UDCTRL_FRAMESTART << 1) /**< Shifted mode FRAMESTART for LCD_CTRL */
#define LCD_CTRL_DSC                       (0x1UL << 23)                      /**< Direct Segment Control */
#define _LCD_CTRL_DSC_SHIFT                23                                 /**< Shift value for LCD_DSC */
#define _LCD_CTRL_DSC_MASK                 0x800000UL                         /**< Bit mask for LCD_DSC */
#define _LCD_CTRL_DSC_DEFAULT              0x00000000UL                       /**< Mode DEFAULT for LCD_CTRL */
#define LCD_CTRL_DSC_DEFAULT               (_LCD_CTRL_DSC_DEFAULT << 23)      /**< Shifted mode DEFAULT for LCD_CTRL */

